{
    "data": [
        {
            "id": 0,
            "name": "Sharetea",
            "yelp_url": "https://www.yelp.com/biz/sharetea-san-diego-13",
            "yelp_rating": 4.5,
            "reviews": [
                {
                    "text": "My drink was made fast and was so suprise on how well it tasted you can tell they only use natural ingredients and can tell the effort they put into my drink",
                    "mycase_score": 2.875,
                    "yelp_rating": 5.0
                },
                {
                    "text": "10/10 service10/10 taste of ube boba10/10 price for size of boba3/10 parking, very difficult to find parking in the outlet",
                    "mycase_score": 1.25,
                    "yelp_rating": 4.0
                },
                {
                    "text": "*Late post*Went here a few weeks back. It was a cool place and everyone was real nice. Had the taro ice blended with pudding. It was very good and didnt last long. LOL. Parking is kind of tough especially in the evening. Would definitely go again whenever I am in the area.",
                    "mycase_score": 3.0439814815,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Great spot to grab your daily boba tea. Clean and organized inside",
                    "mycase_score": 3.4722222222,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I get so excited to see places like this doing well. Small, locally owned, and eager to please, businesses like Sharetea improve neighborhoods and support the community by selling local crafts and serving a high quality product. I will admit that when I initially saw my acai bowl that I thought it was pretty small for the money, especially since I ordered the \"large\" size for $11. Heres the thing, this acai bowl is DENSE. The acai wasnt loose and melty, the toppings were proportionate, and I finished my bowl feeling very satisfied. Dare I say full? Im very grateful to have a place like this in my neighborhood and will certainly be supporting. See you soon, Sharetea!",
                    "mycase_score": 2.771850471,
                    "yelp_rating": 5.0
                },
                {
                    "text": "This Linda Vista location is very convenient for me as I work out at a nearby gym so I can grab a beverage here afterwards if necessary. Its the same menu as offered throughout the Sharetea chain. Unfortunately, parking in this narrow strip mall is just as bad as the shop on Convoy Street if not arguably worse because every space is so tightly packed.I usually get one of their fruit teas (Passion Fruit Green Tea or Hawaiian Fruit Tea with Aiju Jelly) which range in price from $4.25 to $4.50. Add another $0.75 for boba pearls and youre above the $5 mark after tax. The size of the drink and quality of the tea were pretty reasonable. The chewiness of the pearls was not quite up to the level of my favorite hangouts though.One aspect which I did find incredibly annoying is the $0.50 surcharge if you requested less ice for your drink. That used to not be the case when they first opened. I am not aware of another bubble tea shop that has such a policy either. I also dont understand why the boba cost is 50% more than elsewhere. On the other hand, this spot offers a frequent user card which is a bonus because the one in Kearny Mesa no longer does.",
                    "mycase_score": 2.2202380952,
                    "yelp_rating": 3.0
                },
                {
                    "text": "The taro milk tea was very good, and so was the passion fruit tea. You can choose the level of sweetness and amount of ice. The location is next to USD and theres a good donut shop nearby. Id go back.",
                    "mycase_score": 3.375,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I love at this place! Their blended drinks are my favorite! Matcha, Thai tea, Oreo... Their fruit and milk teas are great too. They also have a rewards card so after 10 stamps your next one is free or deeply discounted depending on what you order. Best boba in SD!",
                    "mycase_score": 3.6428571429,
                    "yelp_rating": 5.0
                },
                {
                    "text": "COVID-19 review:Been here several times and I havent had any complaints about the boba tea they offer. They have variety of tea and non-tea drinks too. Their bobas are always cooked right and the customer service is good here also. They only have one size. One thing to note though, their music is so loud that I feel like I have to yell every time. The place can be tight so you may want to wait outside due to the virus.",
                    "mycase_score": 2.5701530612,
                    "yelp_rating": 5.0
                },
                {
                    "text": "It wasnt bad but it tasted watery and sour I got the taro boba like I said it was bad but it wasnt good. Please dont get this if you hate watery or sour. Thank you!",
                    "mycase_score": 1.75,
                    "yelp_rating": 2.0
                },
                {
                    "text": "Great tea, nice consistency (blended type teas). Helpful staff. Love the bobas omg so soft and chewy.Good flavors. Ive had the mango, Thai tea, taro. I already got a punch card for the times Ive gone. Great boba serving for tea size.",
                    "mycase_score": 3.9,
                    "yelp_rating": 5.0
                },
                {
                    "text": "My go to spot since we live nearby!! I usually order via phone or online and pick up since it can be a bit crowded. Plus parking can be tight. But their drinks are always delicious! My favorites are the milk tea with ice cream, taro blended or the Strawberry Lychee with ice cream! I always judge boba places by how their boba is and so far Ive never been disappointed. Thanks Sharetea for satisfying my boba cravings!!",
                    "mycase_score": 3.1618867244,
                    "yelp_rating": 5.0
                },
                {
                    "text": "We absolutely love Sharetea! Their Boba is so good. I think its awesome that you can choose your own sweetness level. I get mine 50% less sweet than usual. The QQ Happy Family is the BOMB. It has five different toppings in it, makes it so interesting! I never heard of herb jelly before and now I cant get enough of it. The staff here is really friendly and the service is quick. The only reason this place doesnt get five stars is because the parking in the shopping center can be brutal. Its unfortunate because its not really a reflection on the business itself but it is part of the experience.",
                    "mycase_score": 3.0055555556,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Parking is really small and tight, but I ordered the POG with no added sugar because all the flavoring is in the syrups! It tasted great and refreshing and it was quick service! I definitely recommend and good luck with finding parking!",
                    "mycase_score": 3.1802721088,
                    "yelp_rating": 5.0
                },
                {
                    "text": "My daughter and I have been to ShareTea twice within the last 2 weeks. Its definitely our new favorite tea shop and being close to home makes it a plus! I order the oreo blended drink for her (milkshake) and Ive had both the matcha green tea and hokkaido milk tea with pearls. You have the option to change the sweetness and ice levels. The service has been great, especially with the employees taking the time to recommend teas based on my cravings. We will definitely be regulars!",
                    "mycase_score": 2.9415584416,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I really love the black classic milk tea from here with boba. I always ask for less ice and normal sugar and I am never disappointed!The only problem with this location is the parking situation. Its a tight squeeze for maneuvering your car but also a very congested parking lot. The service was amazing. Amaya was the one who helped me with my order and she was incredibly kind and accommodating! I really love how they have a limit of 5 customers in the store at a time and when you are waiting for your drink, you are asked to wait outside. I love seeing business take the imitate to keep their employees and customers as safe as they can. Overall, I had a great experience at this location and I look forward to trying new things on their ever growing menu!",
                    "mycase_score": 3.2335343228,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Im a little bit nervous since this place is so close to my new house. I find myself getting cravings for their drinks more often than I should! Its so good!First of all when you walk in the place smells like cookies. I tried to order whatever it was but I was told that it was a vanilla wallflowers from Bath and Bodyworks haha For about six bucks I got a huge frozen mango tea with vanilla ice cream and lychee jelly.The location is great with plenty of parking and its easy to pop in and pop out after the gym or on a hot day to cool off.On those cooler days in San Diego (like all 6of them when it rains, you can get a hot drink with various toppings as well.Seems like it was a cool younger Harajuku sort of crowd when I was in there but it has a very pleasant welcoming atmosphere for everyone! Absolutely love it and will definitely return.",
                    "mycase_score": 3.2025883838,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Im a little bit nervous since this place is so close to my new house. I find myself getting cravings for their drinks more often than I should. First of all when you walk in the place smells like cookies. I tried to order whatever it was but I was told that it was a vanilla wallflowers from Bath and Bodyworks haha For about six bucks I got a huge frozen mango tea with vanilla ice cream and lychee jelly.The location is great with plenty of parking and its easy to pop in and pop out after the gym or on a hot day to cool off.On those cooler days in San Diego (like all 6 of them) or when it rains, you can get a hot drink with various toppings as well.Seems like it was a cool younger Harajuku sort of crowd when I was in there but it has a very pleasant welcoming atmosphere for everyone! Absolutely love it",
                    "mycase_score": 3.2442550505,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Awesome productClean and fast serviceVery helpful and professional with slow orderers. Thank you linda!! The best!And what we got was an amazing strawberry iced blended, with lichee jelly and Boba and ice cream... bought for a birthday boy and he loves it!! I took a spoonful and wow! Soo goodHighly recommend.",
                    "mycase_score": 3.2857142857,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Love me some Sharetea! I was so excited to see that there was a location on the outskirts of SD. I had a hankering for aloe jelly as per usual so this happy accident was a delight. Upon walking in this location is actually pretty big compared to the other locations i have been to. They have a seating area, bar stools and a sizable bar. I opt for the lemon black tea with no sugar and aloe jelly. There was only one size to choose from which is (im guessing) a 16 oz. I started to read the signs near the register and there is pretty much a up charge for EVERYTHING. If you want less ice, up charge, more of anything less of anything theres up charges, which is a little odd. But thats their policy.Our orders were ready within in minutes, Ive had a lemon black tea from SOO many places but ShareTeas was VERY sour. So i would recommend maybe taking the lemon out of your tea if you get any add ons. When i tried to get some aloe jelly i would get giant pieces of lemon instead.",
                    "mycase_score": 2.8069852941,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Im a big fan of this place. Its a Taiwanese chain that is a big hit with USD students especially. Giant menu with lots of individualized options. Today I tried the ice-blended strawberry lychee (with a dollop of ice cream), and it was insanely delicious and refreshing.Fast, friendly service, and the prices are reasonable given the quality. Eventually it will be open again for studying and social hangs. This is a fun little spot.",
                    "mycase_score": 2.9302083333,
                    "yelp_rating": 5.0
                }
            ],
            "shop_restaurant_mc_score": 2.945898141650192
        }
    ]
}