{
    "data": [
        {
            "id": 0,
            "name": "Sunright Tea Studio - Diamond Jamboree Center",
            "yelp_url": "https://www.yelp.com/biz/sunright-tea-studio-diamond-jamboree-center-irvine",
            "yelp_rating": 4.5,
            "reviews": [
                {
                    "text": "Sunright is quickly becoming my favorite tea spot in Orange County! Youre able to order drinks on their app or from a couple kiosks located in the store. Youre easily able to adjust the ice level, sweetness, and add any add ons. This is so convenient and Ive found my drink comes out a lot faster than other tea shops. Drinks I highly recommend ordering include: - Sunright Fruit Tea: Green tea based drink with orange and passionfruit. If you like fruity drinks, this is a must try!- Jasmine Milk Tea: If youre like me, you like to try the basics when youre at a new spot. Their version of this classic doesnt disappoint. - Taro Milk Tea: Black milk tea drink with fresh taro puree! YUMMMM! Stop by if youre in the area! :)",
                    "mycase_score": 3.0332644628,
                    "yelp_rating": 5.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Katie,Thank you so much for your great review, we appreciate it and its always so satisfying to hear from happy customers. Could I suggest some more drinks to try? Our genki sparkling peach tea is new and quite a hit with our guests, if you enjoy matcha then our matcha oolong or strawberry matcha are both delicious and my personal favorite right now is our ceylon milk tea with honey, cheesefoam &amp; oreo bits. Please give any of them a try and let us know what you think.Thanks again and we look forward to serving you soon.",
                    "mycase_score": 3.7926136364,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Sunright Tea Studio is opening up all over. I wouldnt say they are my favorite... but I dont mind getting them if I am already in the plaza they are located at. This location is in Irvine at Diamond Jamboree. I was already in the plaza for lunch, so I was grabbing myself a post-lunch drink to get through the rest of the day. This location has 2 self serve kiosks, credit card or mobile pay only -- no cash. It was a fairly simple process for me, but I can see how this can be discouraging to someone who is not comfortable with technology... like my parents. This business is definitely trying to optimize their staff to making drinks only and not worrying about helping the customer. All of the drinks are one size. My go to drink is the Strawberry Frosty ($5.75) 70% sweet. It has a nice fresh strawberry fruit taste with a nice creaminess. Very refreshing. Highly recommended if you like strawberries. The location seemed to be understaffed or just backordered. The drinks took a really long time to prepare. I super felt bad for the staff as they apologized to each person, sorry for the wait. Ouch. Not their fault they are understaffed. That should be managements issue to deal with. I would only come here if there is no visible line and I am already in the plaza. Otherwise it would be too much of a hassle.",
                    "mycase_score": 2.9488888889,
                    "yelp_rating": 5.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Van,Thanks for visiting and leaving us a nice review, we appreciate it. We removed our cashier when covid started and moved ordering to our kiosks and online system, our customers seem to love it so we kept it going, I think the majority of our guests prefer self ordering drinks but we can also take orders for anyone whom is not comfortable with the technology. We were not understaffed today but unfortunately did have a few very large orders, one for 24 drinks that set us behind so we apologize that you had to wait longer than usual, we try our best to get all orders out within 10 minutes but sometimes we do get slammed, especially on warm weekends. We hope you will come by again next time you are in the area, if you enjoy our strawberry frostie may I suggest trying our fresh mango or peach frostie then adding cheesefoam, they are also quite refreshingly delicious.Thanks again.",
                    "mycase_score": 3.3883928571,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I ordered the Jasmine Green Milk Tea w/ Brown Sugar Boba and it was very delicious. I was really hesitant in ordering this drink because I wasnt sure how sweet the drink is if I were to not make any adjustment for the sweetness level. Their Jasmine Green Milk Tea really hits the spot. The only adjustment that I would make the next time I come to this boba show is to get 75% with less ice. The one I got was 100% sweet with less ice and it was still a little too sweet for me even though it did hit the spot. I would definitely recommend ordering the drink(s) using their Kiosk.",
                    "mycase_score": 2.9921875,
                    "yelp_rating": 5.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Danielle,Thanks so much for visiting and leaving us a fabulous review, we appreciate it. Please do not hesitate to order a new drink from us next time as we are always happy to adjust or replace any drink if you dont love it, we sincerely want all our guests to be fully satisfied with their drinks.Thanks again and we hope to see you again soon.",
                    "mycase_score": 3.4488636364,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I just left Santa Ana airport and and In was craving a Bubble tea. I found Sunright and went there. I preordered an Oreo Brulee Boba milk with Almond milk and it was great. Similar to a Starbucks frappuccino with probably the same calories too!",
                    "mycase_score": 3.5,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Kirk,Thanks for coming by for a drink! I often crave a good boba drink after a flight so we are happy you found us. If you ever want to try something lighter may I highly recommend our sunright fruit tea, ceylon milk tea with honey or a simple iced four seasons tea with 50% sweetness.Thanks again and we hope to see you soon.",
                    "mycase_score": 3.5375,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Time &amp; Date: Thursday, 8/26/21 @ 3pmAmbience: grab &amp; go boba, self-order kioskLocation: by Somi SomiOrdered: - Mango Milk Tea w/ brown sugar boba- Mango Green Tea - Watermelon Jasmine Tea w/ brown sugar bobaSunright Tea Studio is in my top 2 favorite boba shops alongside Yifang. The quality of ingredients and tea is top notch, and every drink is made with fresh ingredients. You get a pretty prominent tea taste in the drinks, which is a good sign that they arent diluting their tea with water! The brown sugar boba is also so soft yet bouncy, and perfectly sweet! My go-to order is the Mango Milk Tea at 50% sugar, there are real mango chunks an none of that fake syrup stuff!",
                    "mycase_score": 3.1666666667,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Rani,Thanks so much for the awesome review and fantastic photo upload, we so appreciate it. We are so happy to hear you enjoyed our fresh fruit drinks. The watermelon cooler and mango milk tea are definitely customer favorites. Have you ever given our honey boba a try? Personally I think they are delicious in fruity drinks, give it a try and let us know what you think.Again, thanks for the review and we hope to welcome you back soon!",
                    "mycase_score": 3.6458333333,
                    "yelp_rating": 2.0
                },
                {
                    "text": "Two out of five stars for their Oolong Brûlée Oat Latte ($5.65). This is a drink that is definitely an acquired taste...which I seem to not have acquired lol. Perhaps one with more refined tastebuds will appreciate this drink more! I ordered it thinking it would be like their popular boba fresh milk series but with tea flavor...? The best way to describe it is probably like a cross between very sweet powdered milk and curdled milk. Not my cup of tea...or rather, milk.The brown sugar boba that day was also not their best. Clumpy and watered down, like what happens when its been sitting out for too long and starts coagulating.I also had a sip of their famous Sunright Fruit Tea ($4.95) and was a little underwhelmed. It was refreshing but nothing special.Ordered online and our drinks were ready ahead of time so that tipped this review in their favor. Very efficient store by the looks of it from the whole ten seconds I was in there when picking up the drinks.Personally I will be sticking to the boba fresh milk, taro flavor, which is so creamy and addicting!Thanks for reading! ^-^",
                    "mycase_score": 3.3106617647,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Sherry,Thanks for visiting but we are so bummed to hear you did not enjoy your brulee latte. As everyones tastes are different please know we are always happy to remake, adjust or replace any drink you are not completely satisfied with, we sincerely want everyone to leave loving their drinks. We hope you will come try something else from our menu, I personally really enjoy our matcha oolong milk tea, ceylon milk tea with honey and our popular oreo brulee boba milk. Please let us know what you think if you give those a try and maybe it will earn us a couple more stars.Thanks and hope to welcome you back soon.",
                    "mycase_score": 3.65,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Sunright Tea studio is located at the diamond jamboree center in Tustin. Its a tiny shop that has a lot of good drinks, from tea, fruit drinks, and more. They always have some new specialty drinks so make sure to check out for those as well. Right now you just walk up to a kiosk and place your order on a touchscreen and pick it up when its ready. You can customize the drinks to the level of ice, sweetness, and toppings. I got the cream pudding milk tea with honey Boba added to my drink. Along with that I got the brown sugar milk tea with Boba as well. In my opinion, the cream pudding milk tea was a little bit better. It had a more flavorful aftertaste that was very nice since Ceylon tea is whats used for it. They seem to have a Lotta nice drinks, definitely worth trying out.",
                    "mycase_score": 3.2383780992,
                    "yelp_rating": 3.5
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Archie,Thanks for visiting and leaving a nice review. Glad you enjoyed your drinks, for your next visit may I suggest trying our oolong matcha milk tea if you like matcha or another custom creation customers seem to really love is our sunright boba milk tea with cheesefoam and oreo bits toppings, it really is quite the treat. Our seasonal fruit teas are also refreshing and made with real fruits, we just launched a sparkling peach jasmine tea that is uber delicious and our sunright fruit tea is always a crowd favorite.Thanks again and we hope to welcome you back soon and hopefully your next round of drinks will impress you enough to get us that last star. :)",
                    "mycase_score": 3.2666666667,
                    "yelp_rating": 3.5
                },
                {
                    "text": "Both of these drinks were really good! Im the peach sparkling drink came out perfectly without any sugar adjustments. The boba milk tea was super creamy and good without it being too sweet. I adjusted the sugar level to 50% but I actually might do 75% because it wasnt as sweet as it appears. TIP: order online! ETA was 10 min to complete the order but it took about 2 minutes. It was so convenient especially because there was a line!",
                    "mycase_score": 3.4814814815,
                    "yelp_rating": 3.5
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Misa,Thanks so much for your kind review, we do appreciate it. We are also pleased that you enjoyed our new sparkling peach tea, it is the perfect way to cool down on these hot days. Our sunright boba milk tea is sweetened with housemade brown sugar syrup which is less sweet than regular cane sugar, we recommend 75 or 100% sweetness for this drink along with our brown sugar boba milk series.Thanks again for visiting and we hope to welcome you back soon for more delicious drinks.",
                    "mycase_score": 3.6429924242,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Sunright is one of my go to boba spots. I usually order the yogurt jasmine tea with mochi or the grapefruit jasmine tea with agar boba. I appreciate this location in particular because its open later than the other one and it is always stocked up on toppings (I find the other store is always out of mochi). Took off a star because parking in this plaza is horrendous and the wait can take a decent amount of time. I am also not a fan of their milky drinks - but that might just be a personal preference thing. Would def recommend checking them out if you havent already!",
                    "mycase_score": 2.5347222222,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Dana,Thank you for leaving us a nice review, we appreciate it! If you enjoy fruity teas may I suggest trying our new genki sparkling peach jasmine? It is quite delicious. Our sunright fruit tea and strawberry jasmine are also very popular and go perfect with agar boba or jasmine tea jelly. Please remember if you ever not love a drink you receive just let us know and we will be happy to replace it for you. Parking at DJ is sometimes a challenge but I usually find plenty of parking in the parking structure first level, give that a try on your next visit and best of all we are just outside the exit.Thanks again and we hope you discover more drinks you like and maybe we can earn that 5th star.See you soon!",
                    "mycase_score": 3.6608391608,
                    "yelp_rating": 3.5
                },
                {
                    "text": "Sunright Tea Studio is located next to 85° Bakery at the Diamond Plaza in Irvine off Alton Pkwy. This shop offers a variety of drinks. We ordered 2 of their fruit teas and 1 milk tea. I think there was something wrong with their milk tea because my friend ended up throwing hers out after we left. I didnt think the fruit teas were all that great either, except for the aesthetic. Really cute branding but the drinks werent anything outstanding.",
                    "mycase_score": 3.15,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Wendy,Thank you for checking us out but we are so very disappointed to hear you and your friend did not enjoy your drinks. We really pride ourselves on serving the highest quality milk and fruit teas we possibly can so it would be awesome if you could give us another chance to serve you up something you will love. We are confident that you will discover something special from our menu. Also please remember our team is always happy to adjust, remake or offer another selection if you are not 100% satisfied with your Sunright drink. We do not ever want anyone leaving unhappy and just throwing their drink away.Please check your PM for a message from me and we hope to welcome you back soon.",
                    "mycase_score": 3.2723214286,
                    "yelp_rating": 4.0
                },
                {
                    "text": "If you love boba tea, Sunright Tea Studio is a good place to get some. You can use the QR code on the menu to order virtually for a contactless experience. The boba shop is fairly small so this is the best way to socially distance from the staff. However, they get fairly busy at the Diamond Jamboree shopping center so theres usually a crowd of people outside as they are located right next door to 85°C. We ordered the Oolong milk tea with organic milk and matcha fresh milk tea with pudding. It was done online and ready in minutes. I like that they have different alternative milk options as well. I was fairly impressed as there was quite a few people waiting in line outside. Im not sure if they were waiting to order or if they didnt realize they could order online for pickup. If you do end up here, order with the QR code or in advance and they will have your order ready in a jiffy.",
                    "mycase_score": 3.0784313725,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Trina,We are very happy to hear you enjoyed your first Sunright experience. Thank you for leaving us a nice review, we appreciate it. Our online ordering page is definitely the way to go. Many of our customers browse the menu and order at home or at their office and just drop in for a quick and easy pickup process. We hope you will visit us again soon and try some more of our hand-crafted drinks. Its getting hot so our fruit teas are a refreshing option.Thanks again and we look forward to welcoming you back in.",
                    "mycase_score": 3.446969697,
                    "yelp_rating": 5.0
                },
                {
                    "text": "There arent many boba/tea spots that become one of my favorites, but Sunright has made its way there! Huge tip is to scan the QR code, so you can do an online order for pickup instead of waiting in line. I ended up getting my drinks in 3 minutes from the moment I clicked submit. I ordered the Grass Jelly Boba Milk Tea ($5.65) and Sunright Fruit Tea ($4.95), which were both popular drinks here. I really enjoyed both of them, but especially the fruit tea. It had fruity flavors over orange juice that gave a light and refreshing taste. The grass jelly milk tea was just the right sweetness at 25% and had a creamy tea flavor. I also loved the cups these drinks are served in. I cant wait to try all their other flavors although I would probably keep getting these same drinks because theyre so good!",
                    "mycase_score": 3.7,
                    "yelp_rating": 5.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Cindy,Thank you so much for visiting us and leaving us such a lovely review, we really appreciate it especially coming from such a dedicated Yelper. We are beyond pleased you enjoyed your drinks and encourage you to try more flavors, anything from our customer favorites list you cannot go wrong with. Thank you for taking advantage of our online ordering system, its the best and easiest way to get your Sunright drinks quick and line free.Thanks again for your kind words and we hope to welcome you back soon for more delicious Sunright drinks.",
                    "mycase_score": 3.505952381,
                    "yelp_rating": 5.0
                },
                {
                    "text": "FAST AND EFFICIENT! I like having the option to order on your phone unlike other crowded and popular Irvine boba shops. My favorite drink is the mango milk tea which is currently a seasonal drink but hopefully theyll adopt to having it as a full year item. Half sweet or 25 is a good option. I dont usually get a topping. Its an automatic large size cup which is nice and I like that DJ has a lot of seating area to hang out and chat while getting boba.",
                    "mycase_score": 3.204004329,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Tyler,Thanks for leaving us a great review, we really appreciate you taking time out to do it. Our online ordering is definitely the easiest way to order drinks from us, who likes waiting in lines right? Our mango milk tea has become quite popular and we will do our best to keep it on the menu as long as we can get quality mangos year round.Thanks again and we hope to welcome you back soon.",
                    "mycase_score": 3.546875,
                    "yelp_rating": 5.0
                },
                {
                    "text": "This is a really popular spot in Diamond Jamboree! They have a line typically for the kiosk ordering station but there are two! You can also order on your phone. They make the drinks fast so its not really a problem. I usually get the strawberry matcha latte but I actually dont like it from here very much. It doesnt taste as fresh or authentic as the other places I usually get that drink from. Its not one of my favorite places just because of that, but I know others love it! It also smelt l bad, like trash outside, but Im sure thats not their fault. However, I do think the plaza should look into that smell or prevent it!",
                    "mycase_score": 2.8555555556,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Jenny,Thank you for leaving us a 5 star review, we appreciate it. I havent noticed a trash smell in the plaza but will definitely look out for it. If you are a fan a matcha have you tried our matcha oolong or matcha frostie yet? Thanks again and we hope to welcome you back soon.",
                    "mycase_score": 3.125,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I was excited to try this place because I recently moved and figured it was really close to my house! I would say its not bad but it wasnt anything super special. I did really enjoy the jasmine milk tea and their signature fruit tea so I definitely recommend to still give it a try whenever your craving some boba! I did really appreciate how fast and convenient the service was!",
                    "mycase_score": 2.8413690476,
                    "yelp_rating": 5.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Yilan,Thanks for visiting us and leaving us a review, we appreciate it. Glad you enjoyed your jasmine milk tea and sunright fruit tea. If you are looking for something more special may I recommend trying the oolong brulee oat latte which is perfect with brown sugar boba, the mango milk tea with honey boba, the strawberry matcha latte, the oreo brulee boba milk and our sunright boba milk tea with cheesefoam. Hopefully one of these drinks will earn us that 5th star.Thanks again and we hope you visit us again soon.",
                    "mycase_score": 3.9732142857,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I recently went through a tough time accepting that every business raised their prices and I had a hard time accepting paying $5 for a drink that I would finish in 17 seconds give or take. That is how much I love milk tea! It is so refreshing and addictive. I like the idea of ordering at a kiosk so that way you can adjust it just the way you like. I cam on a busy sunday afternoon and there was a small line but it seemed to move quickly and there were several patrons waiting for their drinks both inside and outside. I opted for the sunright signature milk tea which was absolutely the right call. it comes with brown sugar and syrup with light boba-- i didnt modify the boba, they just dont put alot but you can pay extra for more. While they recommend 100% sweetness, i honestly wouldnt order more than 50% since the whole drink together was just perfectly sweet.",
                    "mycase_score": 2.7822712418,
                    "yelp_rating": 3.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Christina,Thank you so much for visiting and leaving us a 5 star review, we really appreciate it. While product and labor costs have gone up so much recently I am happy to say our prices have been the same since we first opened and will do our best to maintain current prices as long as we can. We want to give our customers the best value for the quality and size of our drinks. We are glad to hear you really enjoyed your sunright boba milk tea and hope you will drop by again soon to try some of our other choices, you cant go wrong with anything off the customer favorites menu.Thanks again!",
                    "mycase_score": 3.4166666667,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Very solid selection for a milk tea joint. Ive had the creme brûlée boba milk with oat milk and mango jasmine tea. I ordered both drinks at 50% sweetness and still found them to be more than sweet enough! The creme brûlée boba milk was exactly what I wanted- nice and creamy, although the boba was just a tad chewier than I like. The mango jasmine tea was really refreshing, especially with the ungodly heat wave socal has been going through lately.",
                    "mycase_score": 2.9375,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Chelsea,Thank you for leaving us a nice review. We are glad to hear you enjoyed your drinks. We hope you will come by again and try something new, may I recommend our Sunright boba milk tea, fruit tea or Oreo brulee boba milk, they are our best sellers. Our Matcha brulee oat latte, cream pudding milk tea or our new seasonal fresh peach jasmine are all solid choices as well. We hope you enjoy these too and maybe we will earn that last star.Thanks again and we look forward to welcoming you in soon.",
                    "mycase_score": 3.3931818182,
                    "yelp_rating": 3.5
                },
                {
                    "text": "Very happy with their fruit teas here now for a very unexpected reason. So sunright has a very unique and different honey boba than all the other places. Usually other places honey boba are dark color which taste more like honey with brown sugar mixed. But at sunright the boba is clear color. Taste like honey only. Which compliment their sunright fruit tea very well. In fact Im guessing this honey boba probably compliment all the fruit drinks they have because is light and wont make the refreshing fruit drinks too sweet or heavy. Great job sunright! Finally someone got honey boba right!",
                    "mycase_score": 3.0044642857,
                    "yelp_rating": 3.5
                },
                {
                    "text": "Im not liking the fruit tea with sea salt trend. It doesnt taste good. If you order the fruit drinks here and you dont like it salty. Make sure to let them know to leave the salt out.Update to the review : tried this place again with the store recommendation. I got the watermelon cooler with jasmine tea jelly. This time definitely taste better. The fresh watermelon was blended I believe because you can see from the top part of the drink. The jasmine tea jelly fit right in. I got it at 50% sweetness but I think it can even go 25% sweetness since the watermelon itself is fresh and in season and has its own sweetness as it is. Definitely no salt inside this time. I guess next time Ill try the fruit tea again. This place has definitely has grown on me now.",
                    "mycase_score": 3.0625,
                    "yelp_rating": 3.5
                },
                {
                    "text": "Sunright is my new favorite tea spot! They were quite busy on Sunday afternoon but service was fast. You can easily order on their app right at the door or at the kiosk inside. The mango jasmine green tea was one of the best Ive had in the area, full of tea flavor and made with real mango. The brown sugar boba tea was delicious and the brown sugar boba was just the right amount of sweet, and served warm!",
                    "mycase_score": 3.4728535354,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Heather,Thanks so much for your kind words. We are really happy to hear you throughly enjoyed your drinks. We hope you will visit us again for more delicious drinks, please give our fresh peach jasmine, mango milk tea and oreo brulee boba milk a try and let us know what you think.Thanks again!",
                    "mycase_score": 4.1,
                    "yelp_rating": 4.0
                },
                {
                    "text": "This was my second time ordering Sunright and it has always been pretty good, but it doesnt quite beat other boba tea places in my opinion. Maybe I havent ordered the right drinks from here yet. I ordered the peach oolong with cheese foam and its okay. I like the hint of saltiness from the cheese foam. Ordering through the kiosk is super easy and convenient. You can adjust sugar and ice levels for most drinks.Wait: 5-10 minutes",
                    "mycase_score": 3.4236111111,
                    "yelp_rating": 3.5
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Michelle,Thanks for trying us out, I am disappointed you havent found a drink from us you love yet. May I suggest some drinks to try on your next visit that may impress you? Anything from our \"customer favorites\" menu is a safe bet and my personal favorites are the matcha oolong milk tea 75% sweet with brown sugar boba, Sunright fruit tea 50% with agar boba, taro milk tea 75% sweet with grass jelly, mango milk tea 75% sweet with honey boba or a ceylon milk tea 75% sweet with brown sugar boba, cheesefoam and oreos. Please let us know what you think if you give more drinks a try and hopefully they will improve your rating for us.Thanks again and we hope to welcome you back soon.",
                    "mycase_score": 3.1634615385,
                    "yelp_rating": 4.0
                }
            ],
            "shop_restaurant_mc_score": 3.317403902378878
        },
        {
            "id": 1,
            "name": "HNTEA Organic Tea House - Harvard Ave",
            "yelp_url": "https://www.yelp.com/biz/hntea-organic-tea-house-harvard-ave-irvine-10",
            "yelp_rating": 4.5,
            "reviews": [
                {
                    "text": "I was passing through Irvine after driving from San Diego. I wanted to grab a drink for a traffic filled ride back to the SGV and liked what I saw on Yelp. The storefront is a little tucked away, but theres plenty of parking.The interior has a minimalist design and there was a giant table where one patron was doing work. I was sort of surprised to see anyone doing work there because the store has a pretty loud echo. The floor was also like solid concrete so I felt like I caused a ruckus just stomping in and out, but the customer working on his laptop didnt seem to care.There wasnt much of a line and the guy helping me out was friendly. My drink didnt take too long to make and was ready a few minutes after ordering. Their drinks are a bit on the pricier side, but I will 100% be coming back here because I love floral boba drinks and they excel at making it. I got the Jasmine Green Tea latte 50% sweet with boba. If youre a fan of floral boba drinks or a fan of drinks with a strong tea flavor, this is your new boba spot. I absolutely love the freshness, creaminess, and slight bitterness of the jasmine green tea paired with the sweeter, chewy boba. The tea really does taste like its good quality and is very distinct in both tea and floral flavoring. At 50% sweet, the drink is more comparable to 25% at other places so keep that in mind if you have a bigger sweet tooth. Word of caution: if youre super sensitive to caffeine like I am, drink it earlier in the day because the tea is strong so you might be feeling extra energetic from it for awhile.I followed the instructions of shaking the drink 8 times and it does do a pretty gradient as all the layers mix together. Drink packaging is really pretty too, but I wouldnt mind a less aesthetic drink for slightly cheaper prices. Still, I did enjoy it throughly and will be back the next time Im craving boba in Irvine.",
                    "mycase_score": 2.9567396526,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Date of visit: 9/25/2021Excellent drinks and customer service. We are regulars here and our family fave drinks are: - strawberry jasmine green tea: Im not kidding when I say their strawberry jasmine is one of the best out there! Using lots of fresh strawberry, no syrup and organic tea, the result is a drink that is so refreshing and unforgettable! - Premium matcha soy latte: best matcha drink ever! Trust me when I say this because Ive tried many tea houses and Ive compared enough to know which one is a good matcha and which one is not. Pairing the drink with boba will bring it to the next level. Absolutely must order here! - chocolate black tea latte: pretty good too. This time I ordered with oat milk and less milk. Next time Ill order the original formula to know the difference",
                    "mycase_score": 3.2581018519,
                    "yelp_rating": 5.0
                },
                {
                    "text": "If youre looking for strong high quality teas, this is a must try. I opted for a Mountain Rock Tea Latte with Boba, Oat Milk, and 75% Sweetness. The tea was very delicious and earthy. It tasted like a strong version of roasted oolong and paired well with the boba. 75% sweetness, which is their regular, is a good level and not overpowering. The boba had a nice chewy and firm texture, along with a strong honey taste. The drink is on the pricier side ($5.43 + $0.56 for boba), but they dont charge for soy or oat milk alternatives! Online ordering took about 20 min, and it was on time. The store was clean and had an interesting table with humps. I would come back to get this drink, or try their other drinks! 10/10",
                    "mycase_score": 3.4222222222,
                    "yelp_rating": 5.0
                },
                {
                    "text": "A hidden gem in OC! :) No long line, in fact we were a little skeptical when we first arrived but this place did not disappoint! They have 2 locations.I ordered: - Mountain Rock Tea Latte (25% sugar)The tea flavor really stands out which I love! Most of the boba places Ive been to had mild tea flavours but this drink has the perfect milk to tea portion. Also its rare to find Mountain Rock Tea in general so its worth a try! Personally think that 25% sugar is perfect. - Strawberry Jasmine Green Tea (25% sugar)We asked for 25% sugar so its not that sweet but its very refreshing. Surprised that it has real strawberry bits in it to add to the texture.Will definitely visit again!",
                    "mycase_score": 2.9973958333,
                    "yelp_rating": 5.0
                },
                {
                    "text": "The tea here was flavorful and strong, I am always sad when tea is watered down. The cheese cap wasnt my favorite, but was still creamy and good. I would love to try their other teas. I got the mountain rock tea and it had a good, earthy flavor. I really appreciate that their tea is organic. Their menu isnt the biggest, but I felt there was plenty to choose from.",
                    "mycase_score": 3.4047619048,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I really like HNTea Organic Tea House when I first visited their Tustin location, so I was pleased they expanded to an additional location in Irvine. They are off Harvard and Main, in the same plaza as Ralph and Chase, right next to the Jamba Juice. This location seems to still be figuring things out... On the day of my visit it was STEAMING HOT and so uncomfortable. I almost contemplated walking out. They were also unbearably slow making the drinks after they were ordered. I ordered the same thing I got at their Tustin location in the past. I had the iced Cheese Cap Jasmine Green Tea ($5.10) - Perfect Sweet, which is 70 % sweet. This is one of their popular drinks, as indicated with a crown next to it on the menu.The foam ratio was a lot greater than when I got the same drink in Tustin. So even when I took the advice to tilt my drink at a 45 degree angle, all I got was foam, and no tea. I ended up just shaking it up so I can taste all the ingredients. I think whoever made it just overdid it on the foam and messed up the ratios. Hopefully they get their staff trained better and Id be more than happy to come back and bump up their rating once they have it all figured out with this location.",
                    "mycase_score": 3.0548245614,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I love the HNTea in Tustin, so was excited to see there was now one in Irvine! This one was still solid, but not as good as the Tustin Location. The environment felt more sterile and its not a place you can easily chill and study. They have an artsy long table thats more for decor than practicality, and the environment didnt have that same intimate warmth of a tea house that the Tustin location has. We ordered the Mountain Rock cheese foam and sesame cheese foam and both drinks were solid. Mountain Rock is one of their popular drinks and is an oolong type drink. Wish the tea flavor came through a little more like it does at the Tustin location. Alas all locations are not created equal. Got both at 50% sweet and that was perfect. I think we couldve even gone down to 25% and been fine. Overall, HNTea is a good choice for those needing to satisfy their milk tea cravings.",
                    "mycase_score": 3.287109375,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Came back a few more times because I really wanted to like this place since its so much closer than the other boba places. Have to say Im glad I did because any issues with uncooked boba has been resolved. The quantity of boba is still really small compared to other boba shops so Ive fixed that by simply ordering TRIPLE the amount rather than my usual double boba. Tea is flavorful and Ive even gotten used to it tasting more watered down from fresh milk. Quality has been pretty consistent and reliable so Im glad they worked out the kinks from their soft opening. Service is always fast and friendly and prices are reasonable. Definitely recommend this place if youre looking for a more natural boba tea with strong tea flavor. Got the strawberry treasure for my kid and it was really tasty. More of a strawberry milk with bits of fresh strawberries and aloe at the bottom. Mountain rock tea latte is my go to because I love roasted oolong milk tea. The boba is smaller compared to most places so dont be surprised because Im giving you the heads up. Its still good though just make sure to order double boba because they really dont give much.",
                    "mycase_score": 2.9684139785,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Drove by here last week and had to stop by to check out their soft opening.I ordered the Mountain Rock Tea Latte with no ice, 25% sweetness, double brown bobas. For me personally, the strong flavor of the base tea was awesome but I really am not a fan of fresh milk in my milk teas. Its just too watered down and not very rich or creamy even though I know its better for you. For that reason, Id give the milk tea a 3 stars but I think thats a matter of personal preference. I thought 25% sweetness was just the perfect amount of sweetness and was just lightly sweetened so you can still taste the tea flavor. My biggest complaint would be the amount of boba. I ordered double and it felt like it was a single serving. Decided to give this place another try today since they are officially open and I have to say again, I just wasnt impressed. Biggest complaint is the small amount of boba. When I order double and pay extra, it shouldnt be the same amount as just a single serving at most places. Also, part of the bobas this time werent cooked through and were hard in the middle. THIS IS THE WORST. I hate when boba is half cooked. Dont see myself coming back here again. Parking is very limited on this side of the center but there is plenty of parking by Ralphs just around the corner.",
                    "mycase_score": 2.5875576037,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Still soft opening.Got both the Strawberry jasmine green tea and Passion peach green tea (with aloe and boba, respectively). They advised 75% but Id go with 50% sweetness next time. Drinks were much more fragrant than other tea places Ive been recently. Is it from the organic teas they use as base? If fresh made and organic as was advertised, I could say that it was really tasty and worth it.",
                    "mycase_score": 2.4772727273,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Beautiful drink and tons of strawberry bits! Ordered the strawberry jasmine at recommended 75% sweet and perfect ice level. It ended up being a little too sweet still, but I enjoyed it after waiting for some ice to melt to dilute the drink a little. Had to wait 15 minutes for it though because they ran out of boba. Ordered agar but they gave me brown sugar boba (tasted good just took forever to wait for it to be made).",
                    "mycase_score": 3.5546875,
                    "yelp_rating": 4.0
                },
                {
                    "text": "A healthy boba date on Sunday I have wanted to try all boba shops in Irvine. I cannot miss HNTea!Highlights of the menu:1. Cheese cap mountain rock - their signature drink2. Matcha soy latte - with extra cheese cap on top!3. Strawberry jasmine green - very very refreshing! I would order this on my daily basis to drink at work for the healthiness and to not gaining weight 4. Blueberry green tea latteI love the simple yet elegant white design of the store. Its a small store but you can find some photogenic spots to check in on your visit. It also has a beautiful bonsai next to the big table that looks like mountains to me. Very interesting! Set my mood to taste fresh tea leaf in my drinks!I like the top 3 drinks the most for its refreshing taste. The drink size is big too! I dont like the blueberry drink that much compared to the others. Maybe its just only me because it quite depends on your personal preference when it comes to texture. The flavor is okay for me only the texture is not for me. I love the creamy cheese foam a lot! They currently sell matcha powder and more tea drinking tools coming in the future to bring the fullest tea drinking experience. Overall, quick service and healthy drinks. I was about to give HNTea 4 stars for the experience but I changed to 5 stars, for not having the guilty feeling of consuming too much sweets and gain weights after drinking boba When I want an organic healthy drink and to watch out for my weights, I would go for HNTea!",
                    "mycase_score": 3.0147849462,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Ive been looking forward to trying HNTea and all my expectations were met!! First of all, I absolutely love the interior - really clean, on-brand, thoughtfully decorated. Their menu items may seem more limited compared to other tea shops, but they definitely have their specialties. My sister got the Mountain Rock with Cheese Foam and I got the Blueberry Mountain Rock and both were exquisite. This isnt really your typical boba shop, and it was evident that the quality of the drink was elevated. The oolong tea had a really earthy flavor that really tied it well with the other elements. I thought the blueberry worked really well and brought out that earthiness even more. Im not a huge cheese foam gal but my sisters tea was very balanced and the cheese was quite frothy and rich. The cups were also very sturdy and definitely reusable! Im not the biggest boba fan but I can definitely see myself craving this tea again in the next few weeks :-).",
                    "mycase_score": 3.0740546218,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I got their strawberry jasmine green tea and my bf ordered their pineapple jasmine green tea. The strawberry tea was definitely a lot stronger in tea taste than the pineapple tea. The tea was a bit too strong for me, so my bf and I traded drinks. The pineapple tea was mostly just a fruit juice, which I didnt mind. Parking lot can get pretty packed. Store was not crowded, so we were able to get our drinks in-and-out within 5 minutes (majority of time spent on deciding on what drinks to get).",
                    "mycase_score": 2.8697916667,
                    "yelp_rating": 4.0
                },
                {
                    "text": "If youre looking for quality, fragrant tea, look no further. After an extensive search for a boba shop nearby, my friend and I decided to try out a place that doesnt have too much hype (yet). Because the cheese cap mountain rock is perhaps the most popular drink here, I had to get it. Plus, Im a huge oolong fan which made it easy to decide on that choice. My friend decided to get the cheese cap premium matcha drink. We both got 75% sugar which was a perfect level of sweetness and I was shocked by how fragrant the drink was! They dont mess with their teas - the flavor is strong but not overpowering and the cheese foam gave the drink a slight hint of saltiness which I love. I didnt drink straight from the cup however like the instructions say on the lid, as I dont like too much cheese foam with each sip. Im someone who takes hours to finish boba or tea, but I literally finished this drink in 10 minutes. Im not kidding when I say this drink put this shop on the same tier as Omomo - although Ill have to try a couple more drinks from this place before I make a concrete decision ;)",
                    "mycase_score": 2.9291666667,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Visited HNTea as I got a hankering for some good boba. Im glad HNTea is much closer to me. Before, I could only get it if I just so happened to be around their Tustin location. The interior is clean and crisp. However, the huge white table they have is super wonky and mimics those topography model maps, if one was modelling an area with really bulbous mountains. I wonder how people will be able to have a distraction-less conversation if half of their body is covered by a big hump or if they will even be able to set their boba drink down. It was kind of hilarious to see chairs tucked in under the table, because there is no way a person would be able to get any work done or willingly sit there. Anyways, interior design things aside, HNTea is solid and always delivers. I always flit back and forth between the Mountain Rock Tea Latte and the Golden Black Tea latte. The Mountain Rock tea boasts a rich, roasty taste thats perfect for oolong tea lovers. The Golden Black Tea is reminiscent of a HK milk tea. Both are great choices for a person who loves black milk tea. Ive tried their Black Sesame Cheese Cap and while the cheese was great, the black sesame was a little lacking because it ended up tasting like watery milk, completely void of that toasty, nutty black sesame flavor I wanted. Ive always wanted to try their matcha drinks, but Im always hesitant because of the steep price.But, HNTea is a good choice for high quality milk tea, so dont be thrown off by some high prices. And, expect a pretty lengthy wait for your drinks.",
                    "mycase_score": 3.0994270833,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I was really disappointed with my last visit to HNTEA. I went an hour before closing and was really excited to try the Mountain Rock Tea Latte, but the worker told me they had run out of that tea. I decided to order the Golden Black Tea Latte instead and when I asked for boba, they told me they ran out of boba too. I later saw one of the workers make a drink for himself and ADD BOBA. I honestly didnt even want my drink at this point, but the Golden Black Tea Latte was pretty good. It had a strong tea flavor and was a high quality milk tea! Although my drink was flavorful, I was disappointed that they ran out of the tea and boba I wanted especially because I arrived an hour before closing. I would consider coming back to try my original order, but Im still mad.",
                    "mycase_score": 2.64375,
                    "yelp_rating": 3.0
                },
                {
                    "text": "HNTea has been one of my favorite boba shops since it first opened its Tustin location. I was beyond thrilled to find out that they now have two Irvine locations! The tea and boba here are high quality. My favorite drink to get here is the Mountain Rock Tea Latte- it is an oolong milk tea. Sweetness and ice levels are adjustable based on your preference. Other items I recommend here are the Premium Matcha Soy Latte and Strawberry Jasmine Green Tea. This location allows phone orders so we typically phone in our orders so we dont have to wait! They also have a promotion on Yelp right now where you can check-in and get 15% off!Highly recommend HNTea to everyone who enjoys boba!",
                    "mycase_score": 3.0869047619,
                    "yelp_rating": 5.0
                },
                {
                    "text": "This is the cleanest milk tea Ive tasted. I got the chocolate black tea and it reminded me of hot chocolate. I loved that it wasnt super sugary. Also everything is organic here and the customer service is excellent!The interior is clean, bright and airy. So glad this shop is in the neighborhood as it will be our new regular tea spot now.",
                    "mycase_score": 3.2832491582,
                    "yelp_rating": 5.0
                },
                {
                    "text": "First time there, ordered a Pineapple Green Tea, and my friend a raspberry mountain Rock Tea.Its probably my own choice as to why the rating is not higher, but if \"fine/luxury\" tea is the game, I should have ordered something with less added flavor like my fruit tea, and gone with something like a cold brew or cheese cap.For what its worth, the Pineapple tea was great, although very sweet. I do know that you can lower the sweetness level, and Ill probably do that next time, but at its full sweetness, it tastes just like every other tea spot in the OC at a price point that is a little higher than average (though crushed ice and fresh fruit is alot better than syrup and machined ice). Nothing discerning or particular about the tea currently, but I hope that will change with my next visit.Id say definitely worth a try. I know Ill be back to at least get a better idea of their actual tea.",
                    "mycase_score": 2.6326121795,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Jude the cashier was extremely patient and helpful in recommending drinks. Im super picky so I was bombarding him with many questions about the flavor profile and sweetness levels of different beverages. He helped to insure I got a drink I loved and will keep coming back for. Thank you for being so friendly and thoughtful in your responses. The tea tastes freshly brewed and is next level refreshing due to their high quality of ingredients. Every time I come here the boba is always chewy and sweet. I highly highly recommend the strawberry jasmine green tea and passion peach green tea !!! One of my favorite spots to go to - that is on the same level as OMOMO when it come to tasty tea.",
                    "mycase_score": 3.0039351852,
                    "yelp_rating": 5.0
                }
            ],
            "shop_restaurant_mc_score": 3.028893499058517
        },
        {
            "id": 2,
            "name": "Feng Cha Teahouse",
            "yelp_url": "https://www.yelp.com/biz/feng-cha-teahouse-costa-mesa-4",
            "yelp_rating": 4.0,
            "reviews": [
                {
                    "text": "Pictured here are two of their most popular drinks, the Créme Brûlée Dirty Boba and Strawberry Overload.The Strawberry Overload is light and refreshing while the Créme Brûlée Dirty Boba is a decadent dessert in a cup!I have a major sweet tooth so if I were to choose between the two drinks I would definitely recommend the Créme Brûlée Dirty Boba!!",
                    "mycase_score": 2.53125,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I used to be a student at a college nearby and I wish they had opened this store earlier for my boba breaks between classes. I like their creme brulee dirty boba, one of the signatures. The drink is smooth, creamy, and the boba is still warm and chewy.Decor is sweet and simple. The overall color scheme is amazing. The huge teddy corner is highly instagram-worthy. However, they still have a few downsides, which are wait time (we wait quite a while for 2 drinks) and parking (small parking lot, other businesses share the same lot). So the next time I get here, I will try to make it before or after the rush hours to get a better experience.",
                    "mycase_score": 2.9153846154,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Cute and clean shop. Its located on the corner of a mini plaza. The parking lot is small and seems to always be busy so time your visit right. Dirty Boba ($5/6) - I can beat describe the taste as sweet caramel milk. I ordered 75% sweet and I still could taste the caramel flavor. Anything lower I think would taste more like milk. Boba is soft and chewy. The creme brûlée dirty boba is a few cents more and pretty much a salted cream.",
                    "mycase_score": 2.6742424242,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Two visits to Feng Cha and I can say it is ok. Its a cute location in a packed complex. Parking can be a battle. Several people find the most random spots to fit in, but it is a parking spot!First time there, they didnt have any seating. They did have a few booths set up for BTS lovers of the main guy. Im not in the total know of BTS besides really enjoying their music so I felt out of my typical realm which was really awesome. Everyone seemed so nice, followed mask guidelines, and we had a great experience (5 star worthy)Second time there, the lady at the counter seemed extremely annoyed and had some attitude when we gave our order. Total the opposite of what we experienced before. This time you can see their total decor as the tables and chairs were back in place. Super cute, very Instagram-friendly shop. This experience was meh and we just wanted to not bother the lady at the cash register with our business (2 stars worthy)The dirty creme brulee has been my go-to. However, 100% sweetness is way too sweet. 75% was also too sweet for my friend. Its a good drink, but its nothing out of this world. If you go, try the dirty creme brulee boba, but adjust it to your sweetness and take your photos. Unfortunately, Feng Cha wont be on my go-to list for boba unless someone else wants to try it out.",
                    "mycase_score": 2.9104938272,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Great vibe, service, and drinks. The parking is limited but Ive never had trouble finishing at least one spot. Also parking spots are meant for compact cars so tiny spaces. This place is worth it!",
                    "mycase_score": 2.8452380952,
                    "yelp_rating": 5.0
                },
                {
                    "text": "One of the best boba places in OC. ** NOT CLICKBAIT LOL**Its well-decorated and aesthetically pleasing inside! Cute photo-ops and plenty of seats + tables to lounge at. Staff is always friendly &amp; service is fast. The \"Dirty Boba\" is a must try. Its basically brown-sugar boba milk tea w/ cheese foam &amp; creme brulee on top (Yes! They actually blowtorch the sugar!!!) Ive also tried their Oreo Cheese milk tea, and it was decent but not as good as the Dirty Boba. Ive been so addicted, this place is about a 20-min drive from me and I would make the trip for it anyyydayyy. Thats how good it is. Try it for yourself!",
                    "mycase_score": 3.0295138889,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Wonderful service everytime! Consistent with flavor and quality. Solid boba place. Will definitely be back for more.",
                    "mycase_score": 3.28125,
                    "yelp_rating": 4.0
                },
                {
                    "text": "2 visits and 2 boba drinks later, I finally have my verdict for Feng Cha. They get 3 stars from you resident boba-obsessed Yelper. The thing is, Feng Cha has some solid but not so memorable drinks. Im not saying that their drinks arent any good, theyre just not ah-mazing. My past visits I had the chance to try the very popular Strawberry Overload and the Oolong Milk Tea with Cheese Foam and compared to other boba spots, these drinks were not particularly special - not the tea, the flavors, nor the cheese foam. And for a price tag of about $5.50 (large size), I would expect them to blow me away - that aint cheap!The good thing is that they nail the sweetness level as at 50% they were spot on. The not so great thing is during my past visit, they only had a large size available and were out of a number of teas and ingredients. They definitely have some growing pains to still improve upon, but also, its been long past their grand opening stage so I would think they would have been gotten things like this in order by now!",
                    "mycase_score": 3.0813492063,
                    "yelp_rating": 3.0
                },
                {
                    "text": "If you have a sweet tooth like mine then you should definitely stop by @fengchaoc in Costa Mesa for some delicious boba and cakes!! When I saw the menu, I didnt know what I want because everything looked so good! Shout out to their awesome staff and recommendation of drinks! Got their creme brûlée dirty boba, strawberry overload, and strawberry princess cake! Creme Brûlée Dirty Boba: This drink is definitely for someone who loves sweets! This drink was a treat and the perfect dessert to have after dinner! What blew my mind was that the top of the drink actually had the creme brûlée crust! To add on top of all the sweetness, the boba was super chewy which is the perfect texture I like! Strawberry Overload: This drink was super fruity and perfect for those who love fruity drinks! This drink had a strong tea flavor and was not too sweet. It also had bits and pieces of strawberry in this drink which made it better! This is the perfect summer drink to get at any time!  Strawberry Princess Cake: If you love strawberries, then this cake is for you! This cake is topped with cheese milk foam and fresh strawberries with our special made strawberry Purée.I loved their sponge cake and every bite I took had a little bit of everything!",
                    "mycase_score": 3.5553252551,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I saw great Yelp ratings on the dirty boba creme brûlée but I didnt feel like spending over $5 on a drink this day so I chose the dirty boba drink which was under $5.To be honest, I was hoping for a milk tea flavor but it turns out it mainly tasted like caramel and milk and was not a big fan of it. Perhaps Ill try the creme brûlée or the regular milk tea because you cant go wrong with that! Other than that, Id say the interior is very aesthetic and clean and will make a great place to hang out!",
                    "mycase_score": 2.6212121212,
                    "yelp_rating": 3.0
                },
                {
                    "text": "After seeing this on social media numerous times, finally stopped by! I got the creme brulee dirty boba , and I enjoyed it! Their boba is a little odd - it felt really dense but was still chewy so not complaining! The creme brulee top didnt add as much as I thought it would, but overall, a yummy drink!Beware though that parking is a pain! Small lot, lots of spots designated to specific businesses, and lots of cars just pulling off to the side or double parking. I know this is beyond the business control, but really such a headache to deal with! Probably took 10+ minutes to get a spot, and when I did, someone parked close behind me that I couldnt get out of my spot, so just something to keep in mind.",
                    "mycase_score": 2.5045572917,
                    "yelp_rating": 4.0
                },
                {
                    "text": "This place is great if youre looking to try a new boba shop! I personally love their milk foam. It is the right amount of salty and sweet, and it elevates any drink. It is just absolutely delicious. Their boba pearls arent too bad either; I personally didnt think it was anything extraordinary but it was good.",
                    "mycase_score": 3.3665824916,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Taiwanese tea house, specializing in unique sweet drinks. They have a varied menu of desserts as well. Feng Cha has 10 locations scattered across CA, TX, and NV. This Costa Mesa shop is in a strip mall, nearby some of OCs best Japanese restaurants. The interior was sparse, the floors were dirty, and their credit card machine was broken, but the employees were friendly. I got their signature drink, the Creme Brûlée Dirty Boba. The cashier advised me to order it 75% sweet or less, which I appreciated. It was indeed extremely sweet. The decadent, dessert-like drink was delicious, tasting of heavy whipping cream and caramel. The perfectly tender-chewy boba were fresh, in fact, still warm. I only wished the drink tasted remotely of tea. I would not order this drink again, but am interested to try more of their menu, and will try a dessert next time.",
                    "mycase_score": 3.0592105263,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I had the dirty crème brûlée boba, with half sweet and ice. Quite frankly, this was the best boba drink Ive ever! Ive never had cheese foam before, but I really enjoyed how the saltiness of that counteracts with the sweetness of the sugar. Also, as a huge crème brûlée lover, this did not disappoint. No, it doesnt taste like creme brûlée (just get yourself crème brûlée if thats what you want), but you definitely get the experience of it by cracking the sugar.The location is a small place, with a few tables and chairs. It got pretty busy at times, and my drink took quite a long time to be made. Felt like 10 minutes. Not a complaint, just an observation and something to consider if you are in a rush. Parking wasnt an issue at all, since they have their own lot. But I can see it getting crowded around dinner time bc there are a lot of restaurants in the same plaza, and its not a big lot.One note, terrible place to meet friends for a chat. Very loud and gets crowded at times. They play music really loudly, and orders are being yelled out, and constant influx of customers. Altogether, it was overwhelming to sit inside. Unfortunately they dont have outdoor seating and your only option is to stand in the parking lot among the Priuses and Teslas silently roaming around for a parking spot.Nevertheless. Im in the country for 4 more weeks, and 110 percent I want to come back for another, at least one more time before I leave!",
                    "mycase_score": 2.5151515152,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Came here after having lunch at Kitikata ramen! So this little boba spot right here carries the most amazing, dirtiest boba ever. They call it The Dirty Boba Creme Brûlée! OMG! Its soooooo good. With salted cheese as well. Sounds weird but its amazing!! Malea my mouth water just thinking about it. Highly recommended- I would Maybe go less sweet next time, but dayam it was good. They actually creme brûlée it on top! And the little crunchy flakes of the brûlée float to the bottom and you get the crunchy bursts of sugar at the end of your drink. Ooooh so dirty! Sooo good! Best part is they use lactose free milk! That way it doesnt get too dirty - know what Im sayin. If youre ever in town - go try it out!",
                    "mycase_score": 2.9519736842,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Wanted to try something new so a boba cake was next for our dessert! Its basically a milk tea boba on top of a simple cake. Probably something that we would try once and not again. Tastes good though!Ordered: Sea salt pearl cake",
                    "mycase_score": 3.1681818182,
                    "yelp_rating": 4.0
                },
                {
                    "text": "After seeing pics of this place on Yelp, I had to give it a shot. Being a fan of boba tea drinks, the Creme Brûlée Dirty Boba was just calling my name. The shop isnt very big but it was clean and there was a decent sized line. I ordered the drink just the way it comes to see how it would taste. It was a little overwhelming with sweetness so maybe I should have gone with half the sweetness. I mean I get it, its Creme brûlée so burnt sugar and custard would be the primary flavor so it would be naturally sweet. The boba could have been a little chewier but maybe I got a little bit of the old batch which was hard textured. They have a variety of tea, and fruit drinks to try out here that I should have tried out as well, but that is to be saved and tried for another time. A decent first experience at Feng Cha.",
                    "mycase_score": 2.5572916667,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I was just here Saturday at 5:45 PM and a COCKROACH flew and landed on me. It was about 3 inches long. I wasnt aware it landed on me until my boyfriend pointed it out. I knocked it off of me with my phone and it landed on the floor. The workers seemed relatively unphased and tried to sweep a LIVE COCKROACH into the dust pan. Obviously it ran and Im not even sure they got it. I am so disgusted. Definitely not worth the drive from Walnut. Im not even sure I want to drink my drink.Also the boba amounts are not uniform? My boyfriend and I got the same drink and his has way more boba which is weird to me.",
                    "mycase_score": 2.5340909091,
                    "yelp_rating": 1.0
                },
                {
                    "text": "We hired Feng Cha for our wedding! We ordered 50 drinks and I communicated with the manager before the wedding. Boba was dropped off and WITHIN 15 MINUTES IT WAS GONE D; It was soooo popular! All my guests enjoyed it immensely, it was many individuals FIRST boba!! Shoutout to the staff preparing and dropping it off for us! Highly highly recommend couples hiring them for their wedding catering :)",
                    "mycase_score": 3.3375,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Cute boba shop. Purple reign is an interesting drink. Its basically grapes smoothies with yogurt. I got 25% sugar, which is just perfect because grapes are sweet just by themselves.",
                    "mycase_score": 3.96875,
                    "yelp_rating": 5.0
                }
            ],
            "shop_restaurant_mc_score": 2.9704274668222133
        },
        {
            "id": 3,
            "name": "Ding Tea Irvine",
            "yelp_url": "https://www.yelp.com/biz/ding-tea-irvine-irvine-4",
            "yelp_rating": 4.0,
            "reviews": [
                {
                    "text": "Im not a huge boba drinker but I need my fix occasionally.First time at ding tea and the menu is overwhelming with so many yummy choices. I went for the pineapple green tea with golden boba. If you like drinks that arent too sweet, this is for you.My friend got the winter melon, which I actually preferred so next time Ill be getting that.Great service and cute decor, Instagram worthy!",
                    "mycase_score": 2.9962121212,
                    "yelp_rating": 4.0
                },
                {
                    "text": "The perspective that Im lending is as a previous shift leader who managed a coffee shop with very high volume customer base (college campus).I ordered two basic drinks, two teas, and it took over 15 minutes for the drinks to be created.Your employee that was in a black t-shirt mistakenly took down the drinks and I had to repeat it four times. Im not sure if it was because the music was too loud or if she was a new employee and really anxious, but she couldnt run the register without assistance. The entire experience was frustrating.After taking our order, I watched her slide to the hand off station and she proceeded to combine different drink orders together. I almost said something until an employee in a gray shirt directed her to actually read the labels to see the order number as well as the customer name to make sure that customers would get their proper drinks. Had not been for the other employee, people would have walked away with incorrect drink orders. I had to make sure that my drinks were correct. She bagged mine up with someone elses.The thing that gets me the most and I hope that your company educates your employees on, is your cleanliness and overall food health and safety.You have a sign that says all of your staff are fully vaccinated, and I can respect your companys willingness to promote cleanliness and health. Yet, that employee in the black shirt proceeded to touch every single cups interior on the prep line with her fingers immediately after handling money and working on the register. Neither did she sanitize nor wash her hands. Hold the cups from the outside. Never touch the inside of a customers cup.Please make sure you have alignment in your health and safety procedures and your staffs execution of your safety food protocols.",
                    "mycase_score": 2.5968668831,
                    "yelp_rating": 1.0
                },
                {
                    "text": "This is my favorite boba spot. The wintermelon milk tea is to die for ! It has a mellow taste and reminds me of vanilla.I love to add boba to my tea.The golden boba is addicting. Its really the bounce and chew for me though. The crystal boba is delicious as well.",
                    "mycase_score": 3.75,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Love this tea spot, like their variety and flavors. Only reason to give it four stars is the few times Ive visited some of the bobas are a little undercooked. Like the service, signage and decor but they dont have seating areas.",
                    "mycase_score": 2.890625,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Tried their strawberry black tea today and their top fruit tea which is a mix of various fruit teas.",
                    "mycase_score": 2.7777777778,
                    "yelp_rating": 5.0
                },
                {
                    "text": "First time here and got recommended to their monster latte. Tastes like coffee but also chocolate and of course with Boba. Its a tad sweet but it didnt disappoint.",
                    "mycase_score": 3.25,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Love me some Ding Tea! I come here at least once or twice a week for my afternoon coffee. The Hokkaido coffee is my favorite! I usually like things on the not-so-sweet side so I get half the sugar. The coffee is strong and tasty, its that perfect pick-me-up for that afternoon slump. This location is in a small shopping center on corner of barranca and jamboree, kitty corner to the district. Great selection of other teas and drinks and snacks as well. You gotta come and have a taste!",
                    "mycase_score": 3.0416666667,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I love this location!! Its always clean and empty.The parking lot is a little chaotic but this is central to Irvine, and a breeze to walk in, order, and leave.Get the tarp milk tea with golden boba. By far the best out of all boba in the area.Staff is always pretty nice.",
                    "mycase_score": 3.3136574074,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Their Hakkaido oolong tea is amazing, this is what I usually get and should probably stick with. This is not my usual boba place, but its one of the few that do postmates. Normally I might rate this place a 3.5 or 4 from the service and Hakkaido oolong tea, but the rest of the drinks dont live up to this qualitea :(Ive tried the oolong tea with sea cream before and it was chunky and inconsistent, not creamy and doesnt mix smoothly, but it did not change the mouth feel and was overall an average tasting drink. Nothing to be mad at, just not aesthetically pleasing when mixed.Tonight I decided to try the oolong with cheese foam and I was sooo dissapointed. I knew it might be chunky, considering the sea cream was chunky, so that wasnt a problem. I mixed the drink properly by holding it upside down and vigorously twisting and shaking (as I was taught being a former boba barista). When I took a sip, I got a peice of crusty chunky cheese foam and it wasnt a silky melt-in-your mouth consistency :( it was a hard peice that wouldnt even break in between my fingers. Id have to chew the damn thing. I know cheese foam is usually made with cream cheese, which means the cream cheese must have been sitting out to get that crusty peice in there! Yuk! I couldnt even finish my drink after that. The yogurt series is interesting and worth trying. Its a little too sweet though especially strawberry and lychee yogurt tea!",
                    "mycase_score": 2.5149621212,
                    "yelp_rating": 2.0
                },
                {
                    "text": "This is hands down my favorite boba spot. Their drinks are constantly consistent, which I really appreciate. The staff is very helpful and friendly also if you need help deciding. They offer a huge variety of drink options and add-ins to appeal to all. I really love that you can adjust the sweetness and ice. My go-to is the Taro milk tea with boba (25% ice &amp; sweetness). A super solid and dependable boba spot!",
                    "mycase_score": 3.2994791667,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Ding Tea is such a solid boba option. Love the variety of choices and I also really appreciate that their Wintermelon Tea isnt caffeinated since I dont do too well with caffeine. Ding Tea was one of the OG shops that started serving crystal (agar) boba and this is where I fell in love with it. Definitely my favorite topping option. Ive been here just a handful of times and the staff members have always been really friendly and give good recommendations if youre looking for something specific or want to try something new. My only qualm is how sweet the drinks are!! I get 30% sweetness every time and its still so sweet!! I cant even imagine how sweet the 100% would be. I kind of wish there was a sweetness level in between 0 and 30%. But aside from that, I really cant complain about anything else and its a blessing I live so close to this location :)",
                    "mycase_score": 3.3162878788,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Tried when they first opened and tried again a couple months later. It was bad. Hard boba. Tried again nothing changed. This place isnt crowded so I dont get why they dont just take the time to make each order with fresh boba. Would have gave one star, added a star for cleanliness. But hmm .. wonder if thats only cause of the pandemic and theres no seating. Im sticking to Ding Tea near Disney, Ding Tea Garden Grove, and heck Ding Tea La Verne was awesome too. Wonder why this Irvine location is subpar.",
                    "mycase_score": 2.7351190476,
                    "yelp_rating": 2.0
                },
                {
                    "text": "Love that theres one in my area now! Love this place but wish the Oolong Milk Tea I got was sweeter and the boba was hard. Asked for light ice but still felt like it was the regular portion. Sad days. Maybe it was the time of day and it wasnt busy? I went after 6pm on a Thursday. Service is good and the place was clean. The location was easy to find. Adjacent from The District and in the McDonalds/Arbys Parking lot.",
                    "mycase_score": 3.0520833333,
                    "yelp_rating": 3.0
                },
                {
                    "text": "After my fiasco at Ding Tea Tustin, Ive been frequenting this location and love it so much more! Unlike Ding Tea Tustin where I have to regularly wait 20 min for my drink, they are super efficient at the Irvine location! Employees make your drink with haste and consistently too. The best boba shops operate with efficiency, consistency, and attentiveness. Ding Tea Irvine checks all those boxes! Of the many times Ive been at this location Ive never encountered a long line, most is 3 parties deep. And even then my drink comes out in 2 min. Thank you Ding Tea Irvine for being the standard for how boba shops should operate! Employees are super friendly and to the point, no excessive conversations or attitude. I used to be a strictly tea tea milk tea girl, but after trying out the winter melon milk tea I fell in love! Normal winter melon (non-milk) tea is usually too sweet and after drinking a few sips I dont want anymore. But the milk tea is totally different! Im thinking the milk component makes it less sweet and intense. Unfortunately the lowest sugar level is 30% which is still quite sweet but once the ice melts its perfect. Would definitely recommend for non-caffeine drinkers. I love you Ding Tea Irvine!",
                    "mycase_score": 3.1349637681,
                    "yelp_rating": 5.0
                },
                {
                    "text": "One of my favorite boba spots! I usually go with anything Taro if I want light and refreshing, but when I need a kick I do the Hokkaido coffee. Its usually a little on the sweet side for me (but I prefer coffee more bold and robust) so I do half sweet. OBVIOUSLY add the golden boba!",
                    "mycase_score": 2.9839015152,
                    "yelp_rating": 5.0
                },
                {
                    "text": "The OG boba place. The monster boba latte is really sweet so make sure to adjust the sweetness to half if you dont like it too sweet.",
                    "mycase_score": 3.1458333333,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I didnt realize I didnt write a review yet. Since this covid19 started, they were closed for a little bit but then slowly opened back up with precaution in place. I have another Ding Tea closer to me but this location is not bad either. What I like about this one is whenever I want the coffee milk tea, its always available. i cant say that about other locations but this one does always have it. My favorite is the kumquat lemon teach which you can tailor your ice and sugar level of course. I recently just tried the Top Fruit tea as well and I also enjoyed that. I could probably do that one though with no sugar, will try next time Im here. Friendly staff and I dont go in until theres hardly anyone there to allow for social distancing. Yum. SYOY!",
                    "mycase_score": 2.6302083333,
                    "yelp_rating": 4.0
                },
                {
                    "text": "First time here. My new favorite is there Jasmine Green Milk Tea with Golden Boba. Will definitely be back!",
                    "mycase_score": 2.9109848485,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Cant go wrong with Ding Tea, their drinks are awesome!I normally head to the Ding Tea in riverside, but this Ding Tea keeps the consistency of their drinks. I always order the Signature Milk Tea with Boba, and i ask for it to be half sweet and in my opinion it tastes perfect.The service is very quick, people are very friendly, and the store typically isnt too busy. When it is busy I feel like they handle the hecticness very well.Ive been going to this location a handful of times when Im in the area and each time it hasnt disappointed me. Parking isnt too difficult to find, theres a huge parking lot shared by the plaza.Id say the only reason why this wasnt a 5 is due to this odd smell in the store. It kind of smelt like the bathroom?? Not sure if its because they just finished cleaning the restroom or something, but Id probably decide to stay in the store more often if it didnt smell that way.But dont worry it doesnt always smell like that! There was only one time where I really noticed it. Aside from that everything is great!",
                    "mycase_score": 2.712962963,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Clean facility, masks required, staff were wearing masks, great selection of drinks, but wasnt greeted when we came in. I ordered the passion fruit yakult with boba, and my husband ordered their Thai tea with boba. Great flavor, and generous amount of boba.",
                    "mycase_score": 4.1388888889,
                    "yelp_rating": 4.0
                },
                {
                    "text": "The tea here tastes much less artificial than most boba/tea places Ive been to. I get the Thai tea smoothie, and the price point for the size is great. This will probably be my new go to boba place because the price is hard to beat. I love the texture of the grass jelly topping here as well.My main complaint is about the customer service. Its unfortunate that customer service can bring down an establishments overall demeanor. During my most recent experience, I had a cashier who was incompetent and rude, and it had me contemplating if I wanted to come back again. She didnt know how to apply a discount I had for my drink, and she didnt even bother to try and resolve it or ask someone else to apply it. And my discount is now expired. For as long as the price point and quality stays the same, Ill probably continue frequenting the location, but be weary of the customer service! Staff members may be untrained or incompetent.",
                    "mycase_score": 2.2439630682,
                    "yelp_rating": 3.0
                }
            ],
            "shop_restaurant_mc_score": 3.0207830534405975
        },
        {
            "id": 4,
            "name": "Leaf N Cream",
            "yelp_url": "https://www.yelp.com/biz/leaf-n-cream-tustin-4",
            "yelp_rating": 4.5,
            "reviews": [
                {
                    "text": "Hubby and I stumbled upon this little boba shop while strolling through Tustin District and decided to give it a try. I got the Oreo Brûlée Boba Milk and hubby got the Matcha Gotcha. We had no expectations to begin with so we were blown away by how much we loved our picks. My Oreo Brûlée Boba Milk had crushed Oreo and cream mixed with milk honey boba. It was a really delicious combination! Hubbys Matcha Gotcha had great flavor. The matcha wasnt too strong and the drink it self wasnt too sweet. Overall we enjoyed our drinks from here. Would definitely like to come back and try their other drinks!",
                    "mycase_score": 3.2282986111,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Located inside the food court market in The District! Its near the bar and across from the açaí place. Ordering works through a kiosk. We ordered an Oreo Brûlée Boba Milk with no boba and a Mr. Mango. Both drinks were really good! I really like how the cheese foam match with the mango slushie! Drinks were made fast too!",
                    "mycase_score": 3.25,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Came here with student and teacher and we ordered a tea and two boba drinks.My tea was disgusting. Was a lychee jelly peach thing I forget. I had three sips and tossed it. Bitter. Chunks were too large. Odd taste of medicine that is distinct to things that are far too artificial. I also ordered lightly sweetened and it was still so sweet it made me cough.Cookies and Cream boba was reported to be good but nothing great.I forget what the other drink was but it was also left unfinished.Service was also pretty beige and made me feel upset as a business owner imagining how Id feel if my team treated our clients this way.Im only giving 3 stars because Im not a fan of these drinks to begin with so my gauge is probably off. Otherwise Id give it a 2 (rounded up).",
                    "mycase_score": 2.6017316017,
                    "yelp_rating": 3.0
                },
                {
                    "text": "This is one of the most popular drinks, but I didnt love it. I enjoyed the fact that you could mix any flavor into black or green tea, but this missed the mark for me. I did like the aloe in this drink...will try something different next time.",
                    "mycase_score": 2.9404761905,
                    "yelp_rating": 4.0
                },
                {
                    "text": "<span class=\"raw__373c0__tQAx6\">Hi Kat,Thank you so much for your feedback! I would like to let you know that we can always fix or replace your drink if you are not 100% satisfied. Just simply let cashier know. I’m sorry to hear that you didn’t like the blackberry peach black tea. Please give us another try when you are in the area. Thank you!Sam",
                    "mycase_score": 2.5166666667,
                    "yelp_rating": 5.0
                },
                {
                    "text": "We liked the Mr. Mango drink, which is very colorful. Touch of saltiness, perhaps from the cream cheese",
                    "mycase_score": 3.625,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Awesome place! Their drinks are amazing, I try something new every time and its always good. Its my new addiction.",
                    "mycase_score": 3.7863636364,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Stopped by at night to get my boba fixin. Got the dirty milk latte with boba. I asked for less sweet and they warned me that it would lose some of the flavors. I said fine, I dont like my drinks too sweet.The drink tasted delicious. They reduced the amount of syrup/sugar, and at first it was a bit too sweet, but the combination of the milk and other ingredients made it a very well mix. There were a lot of boba and they were perfectly chewy. Id definitely come back here.",
                    "mycase_score": 3.2685185185,
                    "yelp_rating": 5.0
                },
                {
                    "text": "After running errands at Costco nearby, hubby and I decided we wanted to stop for boba on the way home. Leaf N Cream came up on Yelp as one of the top options and super close by, so we decided to give it a try. Its located inside the food court at the District. After seeing the ~recently trending~ Oreo Brulee option that lots of other boba places have recently started offering, I decided to finally give it a try - and let me tell you, I was pleasantly surprised by how delicious it was. It is a sweeter drink, but on a hot day, it was perfectly refreshing and similar to an Oreo McFlurry, but with less guilt (I think?) Their boba was also super fresh and chewy - and I usually never get boba - but it was definitely an enjoyable addition. Hubby ordered the (I think) the Strawberry Crush for a lighter option with 50% sweetness. Unfortunately, it ended up not being sweet enough for him, but was otherwise also very refreshing and somewhat reminiscent of Starbucks old Strawberry Water option. Drinks are a little pricey, but still priced alongside most boba shops these days, so Im sure thats pretty standard. All in all, definitely a great place with lots of options and a make your own options which I hope to try out next time!",
                    "mycase_score": 3.0532852564,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Yelp Reviews: Quarantine Edition #21Solid milk tea with interesting options!Union Market in Tustin sure has changed a lot since Ive last been here. Part of the second or third wave of food halls following the initial success of the Anaheim Packing House, I used to look forward to dropping by for some fried goodies from The Kroft, a cookie milk shooter from The Dirty Cookie, and some fancy milk tea from Milk Box. None of those places are around anymore and the whole space seems pretty dead... another victim of COVID-19.As I walked the empty hallways, reminiscing of casual dining days long past, I stumbled onto Leaf N Cream. While boba joints remain as plentiful in OC as poke bowl places once were, a lot of places are just franchise locations of familiar names who rely on a consistent mix of powders and sugars to produce their addictive drinks. What caught my eye for Leaf N Cream is that they seem to put a lot of effort into making layered drinks: their Ms. Strawberry, Mr. Mango, Matcha Gotcha, Oreo Creme Brulee and Swirl Thai all look amazing!Ive been on a brown sugar milk tea kick for a bit so I ordered their Dirty Milk Latte: rich brown sugar with fresh milk. The weathers too hot for boba so I got it without and asked for light ice... a sweet and refreshing drink for the dog days of Summer.Make sure you mix your drink with a straw before you imbibe, otherwise you might get a mouthful of cream! Will definitely be back to try all the other drinks!",
                    "mycase_score": 2.7306034483,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I wandered in with my bf and ordered a taro milk tea half sweet. It was barely sweet. There is only one size. It was ready in a flash but not something Id order again since there are so many other boba tea shops around. Service was quick since we were the only ones there because Union Market is a ghost town on a week night.",
                    "mycase_score": 3.1527777778,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Theres plenty of parking space in the parking lot but can get packed since theres a lot of stores inside the Marketplace. I tried the Rose Vanilla Green Milk Tea w/ Mango Poppers. The drink itself was pretty good but got really diluted and tasted watered down (even with light ice) after awhile. I still have to try to make my own drink, which will be my next trip!Recommendation(s):- Rose Vanilla Green Milk Tea- Mango poppers as toppings (only if you like a burst of \"fruit juice\" in your mouth)Service: 5/5Tip(s):- Parking can be tough- Store is located inside Tustin Marketplace- They accept Apple Pay",
                    "mycase_score": 2.9902777778,
                    "yelp_rating": 4.0
                },
                {
                    "text": "The place is tucked inside the Tustin Marketplace. I ordered the Mango Coconut Green Milk Tea, and it was great. To be honest, any of their specialty drinks are great and tasty. I have never tried making my own before though (you choose up to 3 flavors), but one day Ill try to make my own. One of my reason for loving this place was that they have popping boba (Mango poppers), and I love those more than boba sometimes. Parking can be hard because its surrounding areas are movie theaters, other restaurants, etc. So you may need to walk a little (also depending on the day/time you go)Recommendation(s):- Any specialty milk teas- Mango poppers as toppings (only if you like a burst of \"fruit juice\" in your mouth)Service: 5/5Tip(s):- Parking can be tough- Store is located inside Tustin Marketplace",
                    "mycase_score": 2.9329861111,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Glad we tried this place located at the District at Tustin. The place has a great vibe, relaxed and trendy with plenty of outdoor space and seating. They have unique creations and your classics boba tea drinks. You are able to adjust sweetness level. Drinks perfectly made and a great spot to hang out. Parking available in a large lot. Lots of other food and drink options, as well as shopping, within the district.",
                    "mycase_score": 3.8389880952,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Im so happy my son saw their sign outside of the Union Market at the Tustin District! We were heading to the other boba place at the District, but veered inside the Union Market to check this place out last month. Ive been there every week since! Great tasting boba, delicious customizable drinks, patient and kind employees, what more could you ask for?",
                    "mycase_score": 3.8333333333,
                    "yelp_rating": 5.0
                },
                {
                    "text": "The drinks here are always just OK. Can barely taste the tea and flavors. Decided to give it another try last week and the barista put in lychee jelly instead of agar boba like I ordered, which made the drink taste weird. I like that it is in the District, but the drinks here taste cheaply made.",
                    "mycase_score": 2.725,
                    "yelp_rating": 3.0
                },
                {
                    "text": "It really is tucked away at the District but worth a try. The drinks I normally order are Purple Yam, Bees Knees, Mancha latte, and Mrs. Strawberry. Generally, half sweet with light boba. I like that fat free milk is used. Creamer makes my stomach unhappy. The drinks will lack that sort of thick taste because theres no creamer. It can taste like its been water down but its because fat free milk is used. Iactually prefer the lack of creamer as it tends to border syrupy or leaves a milk film feeling on my tongue. Boba is the right amount of chewy and stays consistent. There are places with boba that starts out super chewy but then hardens quite quickly. which generally is a sign that the drink was made poorly. In order for boba to stay soft, the ice is added last. You should find the drink cool not ice cold. This might be another reason that adds to the water down taste because it may feel like room temperature on a hot day. I think the price is reasonable and budget friendly. I seem to notice that people who complain about the $5 per drink price also complains about the service. The staff does laze around but if they are done with their task, I dont see a problem. I mean what would you do in that situation? I dont see a problem with flagging someone down for help but then Im also accertive. Try it!",
                    "mycase_score": 2.6964962121,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Staff was helpful and quick. There really wasnt a line or wait time when I went. I probably ordered the wrong thing from here because this place has great reviews. I got the creme brulee matcha and thought it was overly sweet and the boba was a little too soft and lacked chewiness. I did get the sweetness at a quarter percent but still felt like it was overly sweet. Ill probably come back and try a different drink.",
                    "mycase_score": 2.7149621212,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I got the purple yam drink with adjusted sweetness (75%). It was straight up amazing in taste, texture, and of course, look. Cant wait to try their other stuff. Service is sweet and fast. Love it.",
                    "mycase_score": 3.425,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Yes, theres a disclaimer on the drinks that if youre unhappy with it the bobalogist can make adjustments. Unfortunately, we were in a rush to leave due to the rain and we didnt notice this until we were on the freeway already. :)Drinks looked super appealing on Yelp and at their storefront. We were also really intrigued by the unique sounding drinks, so we wanted to try it out. We got the: 1) Coconut salted caramel black milk tea with boba:-Theres a slight coconut taste to a black milk tea-Other than that, theres no hint of salted caramel whatsoever-Maybe my litmus test is too high, because my favorite salted caramel is at Labobatory and this drink paled so much in comparison2) Anastasia black milk tea with boba:-Supposed to taste like chocolate chip cookie dough, chocolate, and toasted marshmallow-Theres a slight toasted taste to black milk tea and it was sweeter than the salted caramel drink. -Other than that, thats it-My friend kept remarking that it wasnt very good to drink and that we had to slough through finishing it because we already paid for it. TLDR; our drinks were really watered down despite asking for regular sweetness and the boba had a really slimy consistency and no flavor (we heard the servers remark whether or not they need to make more boba, so maybe we just got the short end of the stick and got some of the boba that was sitting around). There are other options for boba within walking distance, Id check that out instead.",
                    "mycase_score": 2.6361111111,
                    "yelp_rating": 2.0
                },
                {
                    "text": "Not enough tea flavor. Flavors tasted artificial. Not worth the price. Many other choices in Irvine.",
                    "mycase_score": 2.625,
                    "yelp_rating": 2.0
                },
                {
                    "text": "We wanted to try a new boba place so we stumbled upon Leaf n Cream on Door Dash! We ordered two Bees Knees at light sugar, no ice, and with honey boba. The Bees Knees is an almond + vanilla bean milk tea. The drinks looked aesthetically pleasing. However, the drinks (even at light sugar) were still overly sweet! I could only taste the artificial almond flavor with no hints of vanilla so it was a little dissatisfying. The drink itself was milky and the boba was a little too soft and chewy for my liking. If the drink had more vanilla taste to it and was less sweet, it would be a lot better. Not sure if we will try another drink off this menu as were paranoid the other drinks will be just as sweet, if not sweeter. :/",
                    "mycase_score": 2.9398674242,
                    "yelp_rating": 3.0
                }
            ],
            "shop_restaurant_mc_score": 3.0687156315217634
        },
        {
            "id": 5,
            "name": "Boba Guys",
            "yelp_url": "https://www.yelp.com/biz/boba-guys-costa-mesa",
            "yelp_rating": 3.5,
            "reviews": [
                {
                    "text": "Having found this location in OC was amazing! For the longest time it had only been in NorCal and then in LA so Im glad it finally reached OC! While there is a parking lot, its a nightmare on the weekends. From what I heard from friends, its definitely a lot better during the week. It is located at the CAMP and is such a neat little place though. The aesthetics blend outdoors with indoors. On this day I went, the screen menu wasnt working so the only menu they had was on the counter. Overall, I thought the drinks were the same quality as Ive tried in other locations and they even implemented their bamboo straws here as well! Definitely would recommend for a treat or a boba guys fix -- just better on a weekday!",
                    "mycase_score": 3.03125,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I was super excited that Boba Guys finally opened in OC. Ive only been to the original location in SF a long time ago, so Im not sure if theyve changed their menu or operating style. I remembered that it was the first time I ever tried a hojicha milk tea, and it was so delicious and memorable. There arent a lot of places that have this on their menu, so I was pretty excited to get it again. But this location didnt have just a plain hojicha milk tea, it only has the black sugar hojicha milk tea. I asked if I could just get that without the black sugar. The boba-rista said no, they cant make adjustments cuz it was a special menu item. I didnt understand this because the black sugar hojicha was under a section on their menu that actually says \"BUILD YOUR OWN DRINK.\" How do I do that if I cant make adjustments?Then I asked if they make drinks hot, and she said yes. So I tried to order a hot dirty horchata. Oh, that one doesnt come hot. So I ended up ordering a hot jasmine milk tea, no sugar, with boba. It was just okay, jasmine flavor wasnt nearly as strong as I like. Not sure if Id ever go out of my way to get it again.",
                    "mycase_score": 3.038452381,
                    "yelp_rating": 2.0
                },
                {
                    "text": "I love boba guys... unfortunately this was not toooo good. Came on a Saturday, ordered the strawberry fresca. I asked the front girl if it was sweetened. She said yes but not too sweet. Got the drink.. this is like crazy amount of sweet lol... Boba was perfectly cooked. Will get something else next time and see if its better because that was WAY too sweet.",
                    "mycase_score": 3.2840909091,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Ive heard of Boba Guys through a few YouTube videos and social media articles regarding the boba shortage this summer. They seemed to have a decent business model from what I could see, and I was curious to give them a try if I was near a location. They took over the former cafe/restaurant space next to 2nd Street Japan and turned it into a cute walk-up cafe with some seating under the covered area. The space is modern and clean - perfect to sit or stand under on a warm, sunny day. You walk up to the counter to order your drink and it will come out at the Pick-up window to the left of the register. They do have alternative milk options for those who are dairy-free or lactose intolerant. (Oat milk and almond milk)The gal who waited on me was quick and pleasant. I ordered their black milk tea in a 16 Oz with half sweetness, oat milk, and boba. Prices were comparable to other bubble tea places Ive gone to. At this time they seem to be doing card only transactions. Drink took only 2 minutes tops. They encouraged me to let them know if I needed adjustments. I had to run more errands so I took my cup to go and enjoyed it in the car. Was glad I did 50% sweetness and a 16oz because the boba was very sweet. There were floral notes in their black tea, which was a bit off putting at times and didnt balance well with the other components of the drink. Boba was a good consistency but I did have to toss the rest because it got a little too sweet. Eventually, my stomach didnt care for the drink and I felt a bit nauseous for about an hour after I finished the drink. While the team was nice, the location was cute, and they were trying to make a conscious effort by offering compostable straws, I dont think Ill be coming back here again. Something in their tea didnt sit well with me and I would rather spend my money on a place where I like the tea flavor and the balance of ingredients.",
                    "mycase_score": 3.090158046,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Im so ecstatic that my favorite place to get a strawberry matcha drink is finally in OC! Theyre currently having their soft opening and will have their grand opening on 9/25. I already know this is going to be a popular spot because they have a prime location at the Camp. Luckily, they do have mobile order if you really dont feel like waiting in line. I got the strawberry matcha latte with boba. Their boba is definitely a little harder &amp; chewier so if you dont like that, maybe look at some of their other options! Their straws are also 5/5 because theyre recyclable and dont melt in your mouth.",
                    "mycase_score": 3.0405092593,
                    "yelp_rating": 5.0
                },
                {
                    "text": "first time coming here . heard abt the boba guys hype from SF. the boba is pretty solid. good and chewy and i like how they offer these environmental friendly bamboo boba straws too. cant recommend the thai tea drink though, it tastes watered down and near/worse to canned thai tea you find at the supermarket. the strawberry matcha was fairly good but heads up, if you stir the strawberry/syrup too much like how one would stir a brown sugar boba drink, itll mix out and taste pretty bland. first few sips will be good, the rest? customer service is fair, reasonable wait time but parking is small and packed bc the overall area is popular",
                    "mycase_score": 3.2434895833,
                    "yelp_rating": 2.0
                },
                {
                    "text": "My second time trying Boba Guys! My final verdict is that there are better boba spots out there. The boba was pretty hard and I didnt really enjoy the flavors. Also, the paper straw made the drink taste so weird and grimy. Aside from the drinks, the workers were so nice. I came ten minutes before closing and they all were so welcoming. CONS: The parking is so bad and small!! Valet already takes like half of the parking so people are fighting non-stop for a parking spot. It was like a war zone trying to get parking on a Thursday night.",
                    "mycase_score": 2.4670138889,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Went this afternoon and got a large dirty horchata with boba. Honestly, it was just okay. The horchata was too light for me, I didnt taste the cinnamon and the rice milk that usually comes through so it was bland even with the shot of coffee. I am being really honest here, but there are some outstanding Boba places in Orange County especially in Irvine so Boba Guys you need to up your game.",
                    "mycase_score": 2.6994047619,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I seriously got so excited when I saw that Boba Guys came to town. Cute little outdoors-y shop within the CAMP. The closest one before this is in Long Beach, so definitely a bit of a drive to get my fix. Boba Guys is a solid option if you love boba. FAVE ITEMS:- Strawberry Matcha Latte: perfect amount of strawberry jam goodness (that tastes naturally) mixed with the bitterness of matcha and paired with the creamy blend of milk :)- Mango Matcha Fresca: refreshing! On the sweeter side of things but the mango pairs well with the matcha for sure. SERVICE: theyre pretty fast! PARKING: there is a good amount of parking though its in the CAMP/LAB so it can get busy. PRICE: on the pricier side for boba in generalOverall, solid option for those who like boba that is nice and chewy, and consistently so. Definitely check out the diff seasonal flavors that they have!",
                    "mycase_score": 3.1123903509,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Yup another new boba spot in Irvine. I cant keep up with this rate but I am happy. Boba guys originated from NorCal so Im happy that they opened a closer location. Its located at the Camp. Its a shack for quick boba runs not a store you can hangout at. I got the strawberry fresca tea and it was so refreshing especially on a hot day. The boba was cooked perfectly and very chewy. I love it. My friend got the banana milk and it was soooo good. I wish I knew about it sooner.",
                    "mycase_score": 3.9638047138,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Omg Im so excited they opened one in OC!!! Theyre currently in their \"soft opening\" stages so check their hours before you go. Its located across the Natives Cafe. Theres only one register so the line can go by slowly. WHAT I TRIED :Strawberry matcha - my go to and my absolute fave. A little sweet. Mango Matcha Fresca - this one has sparkling water in it so I wasnt a fan. The mango flavor was overpowered by the bubbles. Banana milk - basically banana flavored milk. Also a little sweet but its good. CONS : all their drinks seem to be premade so you cant adjust sweetness level. I saw them pouring out drinks from cartons thats why your drinks will come out fast. Since its located at the Camp, parking can also be a hassle.",
                    "mycase_score": 2.9,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I got the Strawberry Matcha latte with boba and the drink itself was good.. not overly sweet, just the perfect amount of sweetness. The strawberry and matcha really balanced each other out. The boba itself was really hard to chew, I can taste the sweetness of the boba but for me the texture was not it, it felt like it was undercooked. I like my boba soft and can melt in your mouth. The location of the place is super different compared to other boba spots, I like the outdoor concept. But being in the Camp, youll have some trouble parking. I would come here again but maybe not to get boba as a topping. If their boba consistency improves, I would definitely become a regular here.",
                    "mycase_score": 2.9981060606,
                    "yelp_rating": 3.0
                },
                {
                    "text": "First thought -- so happy that they opened a location in OC. I was skeptical at first since I didnt hear anything about it but checked the website and they were taking online orders so they MUST be opened. My sister and I each got the strawberry matcha latte with boba since thats our all time favorite drink from Boba Guys. I remember this drink bringing me much more happiness..something was definitely off- a bit diluted maybe? Mine had more matcha flavor and hers had more of a strawberry flavor, which likely meant the ratio was off. The lack of consistency was disappointing..The boba was hard and chewy so if you dont like this consistency - I wouldnt get the boba here. If you like Sharetea FVs boba (IYKYK), then you wont like this boba. Its only their soft opening right now so hopefully things will only go up from here.",
                    "mycase_score": 2.8270833333,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Was really excited to see a Boba guys finally open up in Orange County! The worst news is that its in the Anti-Mall, Lab, where there is no good parking and during the weekends, you should just put your hazards on and run in really fast. There seems to be no seating in the actual Boba Guys stall but theres plenty of seats in the area. We ordered the Strawberry Matcha with Oat Milk and the Hojicha with Oat Milk. Both drinks are sooo good. I cant get over the matcha drink; its not overly bitter at all and the strawberries dont taste sickly sweet. I have been a fan of Boba Guys since the first time I was able to try them in SF. The staff here was really sweet, knowledgeable, and patient when we didnt know what we wanted to order yet. I like that they have a window where your name gets called and that it feels like a lot of open space. Great drinks but terrible location. Who knows if Ill find parking the next time I come back?",
                    "mycase_score": 2.7256944444,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Yay! Boba Guys finally made it to the OC! Love love love the teas and boba balls. You can really taste the qualitea! One of my favorite boba ball texture, very bouncy and chewy if youre into that then this is the place for you. Located where East Borough used to be at the camp. Their most popular is strawberry matcha. If you want a fruit tea then strawberry jasmine.",
                    "mycase_score": 3.5,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Ive waited YEARS for boba guys to come to OC! Ive been here every day since I found out their strawberry matcha is PERFECTION. We used to drive all the way to San Fran just for boba guys and one other restaurant. SO happy!",
                    "mycase_score": 4.5,
                    "yelp_rating": 5.0
                },
                {
                    "text": "This week I tried the new Costa Mesa location of Boba Guys. I always loved the one in SF and am super excited that theyre now in OC. When I got there Thursday around 3:30p there was no line but there were a few groups sitting around drinking boba. I ordered the strawberry matcha latte which I really liked while my friend ordered the dirty banana milk. The boba was on the firm side of the boba spectrum.",
                    "mycase_score": 2.9802489177,
                    "yelp_rating": 4.0
                },
                {
                    "text": "My favorite boba shop in now in the OC!DRINKS: My favorite drink is the Matcha Latte / 75% sweet / with boba -- great matcha flavor and not overwhelmingly sweet. The honey sweetener is the best part! A close second is the Black Sugar Hojicha -- it has a roasted flavor that I like when I want a bolder flavor. And my friends love the Strawberry Matcha Latte -- definitely photo worthy and just as delicious as it looks.They have whole milk, oat milk, and almond milk to choose from!BOBA: On the firmer side and nice &amp; sweet.SERVICE: The staff is super friendly and willing to give you their recommendations to make sure you have the best drink! Drinks come out super quickly too.Boba Guys is always consistent throughout all their locations and this new location has definitely exceeded my expectations!",
                    "mycase_score": 3.4872948232,
                    "yelp_rating": 5.0
                },
                {
                    "text": "I came here with my coworkers for lunch. I ordered a large matcha strawberry drink with boba. When I went to go pick up the drink, they handed me a small sized cup. So I told them I ordered a large. He remade the drink and handed me a large cup but he seemed very irritated and said to me \"This time we will make an exception. But you cant do this\" so I told him that i ordered a large drink and he said I should make sure I check the screen. I am not really sure why I am hearing this from him. I ordered a large drink and I want my large drink. If someone needs an exception maybe it should be the person who took my order? I didnt appreciate the blame. Besides this incident, the drink was good.",
                    "mycase_score": 3.1839285714,
                    "yelp_rating": 1.0
                },
                {
                    "text": "Anticlimactic? I heard so much buzz about them but honestly, they did not hold up. I rather do down the block for more consistent boba. I got 2 drinks and both were subpar. Boba was all clumped up into ONE giant ball and too al dente for me. Taste is good. Drinks themselves were not \"mmm!\" More like \"oh meh\" kinda drinks.",
                    "mycase_score": 3.375,
                    "yelp_rating": 3.0
                }
            ],
            "shop_restaurant_mc_score": 3.1723960022441053
        },
        {
            "id": 6,
            "name": "Pink Pig",
            "yelp_url": "https://www.yelp.com/biz/pink-pig-irvine",
            "yelp_rating": 4.0,
            "reviews": [
                {
                    "text": "I had their strawberry guava smash and oh my goodness is it tasty. I could taste the nuts of strawberry and guava with every sip. Their normal sweetness isnt overly sweet and I love it when tea spots dont saturate their teas with sugar. The boba is soft, chewy, and sweet. The perfect boba.",
                    "mycase_score": 3.5208333333,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Definitely not worth the price. Half of my drink is ice... They told me that I cant adjust the ice level for my strawberry boom. Its not even a blended drink. Dont get why I cant adjust it...",
                    "mycase_score": 2.6666666667,
                    "yelp_rating": 2.0
                },
                {
                    "text": "We order 3 drinks online and one of the drinks like this. There are many milk tea stores better than this store in Irvine. I think that we will not come back anymore",
                    "mycase_score": 3.3333333333,
                    "yelp_rating": 2.0
                },
                {
                    "text": "I loved it! The customer service was great. The workers gave me a sample of the gelato and that convinced me to buy some. The drink was fresh and the atmosphere was welcoming. I am DEFINITELY coming back again.",
                    "mycase_score": 3.4,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Great tea and yogurt gelato! The owners were a sweet couple and so nice. Support this new small biz!",
                    "mycase_score": 3.3181818182,
                    "yelp_rating": 5.0
                },
                {
                    "text": "They need more workers and more reliable ordering machines. I waited an hour for my drink which totaled to be $7 and it was only thirty minutes in that I realized they werent making orders for one of the tablets...In short I want to like this place but its so understaffed for being at the edge of a college campus that its almost never worth it to go especially since the drinks are so expensive.",
                    "mycase_score": 2.09375,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Small shop located in UTC! Friendly service and they explain the drinks well and provide good recommendations! Drink was creamy but lacked the tea flavor as some other boba spots. Good buy one get one for $1 deal right now! Try this place if youre looking for a cute new spot.",
                    "mycase_score": 3.4005681818,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Came in for the first time today to try out their drinks! The manager let me know they had a buy one get one for $1 deal so I ended up getting the fruit tea and a milk tea! The shop was super cute and the teas tasted amazing. The manager, Christine, was super helpful in helping me make my selections! I will be back for sure!",
                    "mycase_score": 3.3988095238,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Came to try a new place for milk tea. I am happy that they are non-dairy. However the bottles are deceivingly small and mostly filled with ice. I felt like I finished my $4.25 drink in a few sips. I dont think Ill be coming back. Also the barista canceled my receipt that I wanted, its just annoying because they should ask.",
                    "mycase_score": 2.4237012987,
                    "yelp_rating": 2.0
                },
                {
                    "text": "Noticed their BOGO $1 promo and decided to try it out. They provide a very similar menu to the Snow Monster location that theyve replaced, instead of ice cream they have gelato. Compared to Snow Monster though they have WAY more drink options, ranging from various fruit teas to even a Nutella Milk Tea, which I ended up trying. My girlfriend tried the Black Sugar Milk Tea.Let me start off by saying the customer service was why I refuse to give 4 stars. As a new shop, you would think that making customers feel welcome is a priority. The lady at the counter had an absolutely cold demeanor; from the moment we walked in there was no hello or any form of response, just stared at us the entire time without a single word. After we paid and said thanks, she immediately walked off to make our drinks. We figured she mightve not heard us, but when we did receive our drinks, we said thanks again only to receive another blank stare in response. So again not so friendly service. It seemed like she really didnt care to be there, and when we left we caught her silently staring at us, presumably waiting for us to be gone so she could go back to talking with a coworker. Now in contrast to the service, the drinks are pretty good! The richness of the black sugar actually complimented the tea very well, which was also pretty good quality. At 100% sweetness it was a bit too sweet, would maybe go for 50% so the sugar wouldnt overwhelm the tea flavor as much. Still a pretty good balance. As for the Nutella Milk Tea, if youve had Tea Bricks Nutella Shake and liked it youd definitely like this. It tastes exactly like youd imagine. They actually blend the Nutella into the milk tea, so while they layer the cup with Nutella (kinda like Omomos matcha drinks) its actually also infused with the tea. I liked it, but its definitely for those with more of a sweet tooth. Both drinks ended up to be around $6, which is nice. So good drinks but poor customer service. Also we sampled the gelato and it was okay.",
                    "mycase_score": 3.0212917869,
                    "yelp_rating": 3.0
                },
                {
                    "text": "5 stars for the nice cashier. She gave us the combo discount even though we ordered the sorbet and milk tea separately. She also let us sample all of the gelato flavors. The milk tea was okay. It was a little lighter in flavor and creaminess than average. The mango sorbet, however, was really good. It was the most mango flavor I ever had and the texture was very smooth. The cashier mentioned it was made with just fruit and water and also that she just made it today.",
                    "mycase_score": 3.2760416667,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Skeptical of yet another boba shop in UTC however it was decently good. All of the drinks that are available are dairy free, I tried to ask the cashier to specify what kind of milk but they didnt know all they knew was that it was dairy free. I tried the brown sugar milk tea and it was good the only thing I would advise against is getting the boba. It was too firm and you can tell it been sitting for a while.",
                    "mycase_score": 3.28125,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Super nice staff and yummy drinks. The ambiance was nice. They also have gelato I didnt try it but it looks really good. I had the chichi mango, it was blended with fresh mango, and was super refreshing. Overall seems like a super nice place I am excited to try there other drinks!",
                    "mycase_score": 3.5625,
                    "yelp_rating": 5.0
                },
                {
                    "text": "What an amazing dessert shop! The baristas were super helpful in recommending drinks, especially Kristina and Suri! I got the Guava Strawberry tea, and it tasted both fresh and absolutely delightful! The Roasted Oolong Milk Tea is also a must-try. This is not to mention the interior is super cute and comfortable. Overall, a place not to miss!",
                    "mycase_score": 3.462962963,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Very friendly owner. Had a fun board game called Klask which we played for 30 minutes while sipping our tea. Great buy one get one for 1 dollar! I got the golden oolong milk tea with honey boba. The milk was very creamy and the boba was very well made. The only critique I would have was that the tea flavor was on the softer side possibly because of how creamy the milk tea was. Overall, a great experience and a great addition to the University Town Center!",
                    "mycase_score": 3.21875,
                    "yelp_rating": 5.0
                },
                {
                    "text": "pretty solid boba shop. except make sure u ask for less ice (because they pack their drinks w ice). also they always seem understaffed which is why the drinks take awhile to come out",
                    "mycase_score": 3.125,
                    "yelp_rating": 4.0
                },
                {
                    "text": "Staff and service were cordial and fairly quick, especially considering this is a new shop. My review concerns the tea drinks! I got the Passion Lime (Green Tea) and my brother got the Hokkaido. My brother enjoyed his Hokkaido very much so Im sure its a good drink. Said the tea flavor wasnt too strong, which many people look for in a Hokkaido. My Passion Lime was at 25% sweetness but I still felt it was too sweet. It had real lime, but the passion fruit was clearly a syrup. Fruit syrups are one of my pet peeves! Still, it didnt make the drink inedible - just too desert-like for my tastes. The pearls though... why Im taking off two stars. It was so hard, clearly old, and the honey coating added a sickening flavor to my drink. When I avoided the pearls, my drink tasted so much better. I will still return to try their other drinks, but maybe with no pearls. Incorrectly cooked or old pearls make me seriously ill.",
                    "mycase_score": 2.8557449495,
                    "yelp_rating": 3.0
                }
            ],
            "shop_restaurant_mc_score": 3.1387873836403246
        },
        {
            "id": 7,
            "name": "Boba Junkie - Santa Ana",
            "yelp_url": "https://www.yelp.com/biz/boba-junkie-santa-ana-santa-ana",
            "yelp_rating": 4.0,
            "reviews": [
                {
                    "text": "Hands down BEST boba!! Clever name too. Always on the hunt for a good boba shop. Hung out in OC for a few days and figured try this place based on the reviews. Man was I glad I did. Basically got it errrrryday!! Their milk tea isnt too sweet but also not too creamy. Their boba is the PERFECT consistency and you can tell it is fresh. Their menu is pretty extensive and seems like you cant go wrong with any beverage you get here. The place itself is in an outdoor shopping mall so plenty of parking and doesnt seem like the mall gets too busy. Wish there were more branches outside the OC. Went to 2 of the branches in OC. Staff is friendly and place is nice and neat. Few tables inside for seating.. But will definitely be back when I am in the area. Must try!",
                    "mycase_score": 3.3069444444,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Drinks alright. Gave me rose milk tea instead of the rose jasmine I ordered but it was good. Customer service sucks. Like damn if you see two people standing there for a good while at least ask if theyre here for an online order (which we were) instead of avoiding eye contact. We were being polite and just waited because it seemed like they were busy but then someone else came in and got there online order and the girl gave the drinks then immediately turned her back away from us",
                    "mycase_score": 3.3571428571,
                    "yelp_rating": 2.0
                },
                {
                    "text": "Boba isnt as abundant in Santa Ana as other parts of OC, but Boba Junkie seems pretty popular. I ordered ahead online through their website and the drink was ready promptly. I recommend doing this to avoid the in-person lines! Got the house milk tea + boba, which was appealing because (1) they use earl grey as the base; and (2) it is sweetened with brown sugar. I ordered mine 50% sweet but after tasting it, Id probably get this even less sweet. The boba was definitely on the softer side. Wasnt crazy about it but it could just be a quality issue from that day.Theres enough interesting drinks to try to want to go back, but Ill make sure to make adjustments!",
                    "mycase_score": 2.796875,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I mean the name of this place is basically describing my tea loving alter alter ego. They have a good variety of items here that can be choosing using a touch screen ordering system. At this current time due to the pandemic, there doesnt seem to be a seating area so all the drinks are To Go. I got to try the almond milk tea with honey glaze and the rose milk tea, of course both of them with boba. Most of the time I get my sweetness level down to 50% and the ice level low as well so its not too watery. The boba was nice and chewy (as you would want it) and the drinks were just fine. Its a decent option if youre in this part of Santa Ana.",
                    "mycase_score": 3.1614583333,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I am quite impressed with this place! I enjoyed both the mango colada and the Thai tea slush especially on a hot day!",
                    "mycase_score": 4.1666666667,
                    "yelp_rating": 4.0
                },
                {
                    "text": "I dont have a ton to day except offing was easy at the kiosk snd the drink came out fast (of course it wasnt busy). The boba is super fresh. I could have used a stronger tea taste, but its not bad.",
                    "mycase_score": 2.7777777778,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Went here on a late night boba run and got the pinapple slush with lychee jelly. For a $6 drink I would think that I would at least get a full drink but that was not the case. The drink was not fill up all the way. On top of it the taste was alright. Nothing special. The staff did made us wait for a while even though there was only 1 order ahead of me. I would probably not come back here unless Im too lazy to go out of my way.",
                    "mycase_score": 2.6275510204,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I have Never had a boba place give me three quarters of a drink and expect to pay full price. First time trying this place, our friend suggested it but was not impressed from the start. Small spot, only one spot to place an order, no interaction from the employees and the flavor of the drinks tasted watered down. I selected the Green Thai Tea and my wife got the Classic Milk Tea both of our drinks were ordered at 100% sweetness but tasted like 75% or less, our daughter had the original Thai Tea and same situation flavorless, skimped and plain. Gave it more start for the decor, variety of flavors but might not be coming back to try more if this is their standard.",
                    "mycase_score": 2.8693452381,
                    "yelp_rating": 3.0
                },
                {
                    "text": "My friends and I came to this location because it had such great reviews and when we got there there was a decent sized line so we were pretty excited. We thought the boba would be really great. I cant really comment on the service since we ordered off the touch screen in the front so there was very minimal interaction with staff which is fine during covid. I got my taro milk tea with Oreo and it didnt really taste like taro. It also wasnt very sweet. Not much Oreo for paying extra. I was a bit disappointed. My friend got hers and she was saying hers was really watery and I tried hers. I was like wow I thought mine wasnt very good but hers was really tasteless and watery. It was also more expensive than most boba places Ive been too. Hoping it was just a bad batch because all the other reviews say how great it is. Wish I had a better experience :(",
                    "mycase_score": 2.9057539683,
                    "yelp_rating": 2.0
                },
                {
                    "text": "Ive heard a lot of good things about this place so I decided to give it a try when I was finally in the area! At the store, you place your order through a kiosk to minimize contact with the employees. Plenty of hand sanitizer available so also good to know this place is COVID-conscious! Their employees were super friendly and brought a lot of energy to the place. As for the drink, I ordered the honey jasmine milk tea with boba. I couldnt really taste the honey, but still really enjoyed the drink. However, their boba consistency was perfect. So chewy! Would definitely come back next time to try their other drinks.",
                    "mycase_score": 3.3767361111,
                    "yelp_rating": 5.0
                },
                {
                    "text": "My brother and I were looking for a new boba place than the ones we usually go to. We tried out boba junkie and I will say it was a very nice change. I got the matcha drink, and I thought it was excellent, and my family also said that their drinks were amazing. The customer service was very prompt. Because of COVID, you had to order on a screen, and they would text you when your order was ready. Loved it!",
                    "mycase_score": 3.5665584416,
                    "yelp_rating": 5.0
                },
                {
                    "text": "Its okay. Not enough for justifying a trip here tbh but nothing too bad either. The biggest problem I thought were the drinks being really sweet for their sugar level, not to mention that it tastes a bit too much like watered down corn syrup.Came in the evening and the place was sorta packed with Tik-Tokers and teens, that sort of vibe. You order through a touchpad, and it showed pics of all the drinks which was nice. Prices are average and what youd expect from 2nd tier boba (the level below premium boba shops). As for the selection, they had a menu that sorta changes, like when I looked to see if they had matcha tea, the pics on Yelp shown that they have it, while when I went, it wasnt listed. Anyways, I went with the house milk tea with early grey, boba, and cheese foam. Ordering and getting the drink was contactless and quick, in spite of the small crowd. Just FYI, social distancing wasnt really enforced. Everyone looked like teens so I wasnt too surprised. As for the house tea, it was so-so. Definitely on the sweet side even at 25%, although the boba was fine. Also, I think its about the same watery level as ding tea or gong cha, nothing bad but nothing great either, maybe a little worse than those two as well as the closest comparison I can think of. Also the fructose syrup has a weird aftertaste that I cant pinpoint but I think its the cause of it being sooooo sweet. For a fairly crowded boba spot this place is a bit disappointing.",
                    "mycase_score": 2.6385030864,
                    "yelp_rating": 3.0
                },
                {
                    "text": "I got the icy taro ($6.65) and milky papaya ($6.65), both at 75% sweet.  Milk alternatives seemed to be $0.65 extra and crystal boba was an extra $1.00. One drink cost me over $8 and the other $7. What I got were two overly sweet drinks that tasted completely powder-based. The crystal boba I got was only enough to cover one layer of the bottom of the cup. Im disappointed in these drinks especially at these price points for it to just taste like powder.",
                    "mycase_score": 2.4861111111,
                    "yelp_rating": 2.0
                },
                {
                    "text": "We tried Lavender milk tea, rose milk tea and Jasmine milk tea. All items are so so taste. Can feel the tea but overall there is nothing special . The topping grass jelly, Crystal boba and regular boba are also very average.",
                    "mycase_score": 2.9035714286,
                    "yelp_rating": 3.0
                },
                {
                    "text": "We ordered a taro milk tea and 2 other drinks last night. This drink came out and the color looked nothing like a \"taro milk tea.\" I asked the lady work there \"are you sure this is taro milk tea?\" because the color was so dark, obviously a cacao milk tea or something chocolate. She said yes our taro looks like that. I have the drink today and I was right, its not taro milk tea. It would be okay if the lady admitted its not taro then we will be happy to take this instead of the drink we ordered, but this case she lied so definitely not gonna come back!!",
                    "mycase_score": 3.015625,
                    "yelp_rating": 1.0
                },
                {
                    "text": "First time here! It was close by Waba grill so I decided to try it! The name of the business fits their drinks! It was junk. The boba we got was supposed to be brown sugar milk tea, like tiger sugar boba... well its so disappointing because its just milk with boba nothing else! Paid over 5 dollars for milk... the boba was too sweet, not chewy anymore and it taste just like milk with sugar. Cheaper to buy a gallon... the place is also looking dirty, the lady that is making our drink kept dropping the ice on the countertop thankFully she did not put it back on my drink coz I would say something. Its weird that they take orders from the iPad, theres only one iPad so you kinda have to wait in line and people take their time to browse around... will NEVER go back here sorry!",
                    "mycase_score": 2.1666666667,
                    "yelp_rating": 1.0
                },
                {
                    "text": "I wanted to love this new little place but golly gee.... it was just ok and I did not enjoy my drink. Looks pretty but taste is more on the down side in MY experience. Its a great place to try if youre looking for something new.",
                    "mycase_score": 3.2922585227,
                    "yelp_rating": 3.0
                },
                {
                    "text": "The atmosphere was pretty simple when I walked in. There is no seating which is not a big deal to me. I ordered the Lavender Milk Tea which was okay, the lavender taste was very mild but what I was disappointed most about was the boba. Some of the tapioca balls were clustered and had like a few hard chunks which was off-putting...the boba also didnt have much of a flavor which may not matter to some people but after trying honey-soaked boba at other boba shops, it was underwhelming. The Lavender Milk Tea comes topped off with a sweet cream foam and tiny lavender bits which I would say was probably the best part about the whole drink. Overall, I wasnt crazy about the drink and probably wont be back, however, staff was nice and welcoming.",
                    "mycase_score": 2.7799479167,
                    "yelp_rating": 3.0
                },
                {
                    "text": "Roommate was in the area and got me this boba drink. I had never heard of this place before and was shocked at how inexpensive and good this is. I will come and check this place out later in the week for other varieties.",
                    "mycase_score": 2.5,
                    "yelp_rating": 5.0
                },
                {
                    "text": "This is the worst boba place I have ever been to. Their drinks are trash except for the lava drinks (only reason Im giving them 2 stars). The rest of their drinks are extremely watered down, especially the coffee and milk tea. When I ordered a milk tea, it looked yellow instead of brown.",
                    "mycase_score": 1.796875,
                    "yelp_rating": 2.0
                }
            ],
            "shop_restaurant_mc_score": 2.9246184295477446
        }
    ]
}